--武林联赛
--孙多良
--2008.09.12

--日程安排
Wlls.CALEMDAR = {
	--周末（周六日）
	tbWeekend = 
		{1500, 1515, 1530, 1545, 1600, 1615, 1900, 1915, 1930, 1945},
		
	--一般时间
	tbCommon = 
		{2000, 2015, 2030, 2045, 2100, 2115},
		
	--八强赛开始时间
	tbAdvMatch = 
		--8进4, 4进2, 决赛3盘2胜;
		--只有第一个时间有效;第一场启动后，后面的4场才会启动，并且启动的时间间隔查看wlls_def文件
		{1900, 1915, 1930, 1945, 2000},
	
	--周末定义(0周日,6周六)
	tbWeekDay = {[0] = 1, [6] = 1},
	
	--一般时间定义
	tbCommonDay = {[1] = 1, [2] = 1, [3] = 1, [4] = 1, [5] = 1},
	
	--比赛结束时间；
	--tbDateOver = {nWeekend = 2000, nCommon = 2130};
	
	--排名时间；
	--tbDateRank = {nWeekend = 2001, nCommon = 2131};
}

--日期必须按从小到大的循序
Wlls.DATE_START_DAY = {{7, 27, 28}};	--8号开始

if (GLOBAL_AGENT) then
	Wlls.DATE_START_DAY = {{7,27,29}};
end

