

-- 技能文件所在位置
LifeSkill.szSkillFilePath 		= "\\setting\\lifeskill\\skills_compose.txt";
LifeSkill.szRecipeFilePath 		= "\\setting\\lifeskill\\recipe.txt";
LifeSkill.szKindFilePath		= "\\setting\\lifeskill\\recipekinddesc.txt";
LifeSkill.szCategoryFilePath	= "\\setting\\lifeskill\\recipecategorydesc.txt";
LifeSkill.szEventRecipeFilePath	= "\\setting\\lifeskill\\eventrecipe.txt";

-- 技能Id
-- 技能等级
-- nTitleGenre, TitleDetailType, TitleLevel, nTitleParam
LifeSkill.tbLifeSkillLevelForTitle = 
{

	[6] = 
	{
		[1] =  {1, 1, 1, 0},
		[10] = {1, 1, 2, 0},
		[20] = {1, 1, 3, 0},
		[30] = {1, 1, 4, 0},
		[40] = {1, 1, 5, 0},
		[50] = {1, 1, 6, 0},
		[60] = {1, 1, 7, 0},
		[70] = {1, 1, 8, 0},
		[80] = {1, 1, 9, 0},
		[90] = {1, 1, 10, 0},
	},
	
	[7] = 
	{
		[1] =  {1, 2, 1, 0},
		[10] = {1, 2, 2, 0},
		[20] = {1, 2, 3, 0},
		[30] = {1, 2, 4, 0},
		[40] = {1, 2, 5, 0},
		[50] = {1, 2, 6, 0},
		[60] = {1, 2, 7, 0},
		[70] = {1, 2, 8, 0},
		[80] = {1, 2, 9, 0},
		[90] = {1, 2, 10, 0},
	},
	
	[8] = 
	{
		[1] =  {1, 4, 1, 0},
		[10] = {1, 4, 2, 0},
		[20] = {1, 4, 3, 0},
		[30] = {1, 4, 4, 0},
		[40] = {1, 4, 5, 0},
		[50] = {1, 4, 6, 0},
		[60] = {1, 4, 7, 0},
		[70] = {1, 4, 8, 0},
		[80] = {1, 4, 9, 0},
		[90] = {1, 4, 10, 0},
	},
	
	[9] = 
	{
		[1] =  {1, 3, 1, 0},
		[10] = {1, 3, 2, 0},
		[20] = {1, 3, 3, 0},
		[30] = {1, 3, 4, 0},
		[40] = {1, 3, 5, 0},
		[50] = {1, 3, 6, 0},
		[60] = {1, 3, 7, 0},
		[70] = {1, 3, 8, 0},
		[80] = {1, 3, 9, 0},
		[90] = {1, 3, 10, 0},
	},
	
	[10] = 
	{
		[1] =  {1, 5, 1, 0},
		[10] = {1, 5, 2, 0},
		[20] = {1, 5, 3, 0},
		[30] = {1, 5, 4, 0},
		[40] = {1, 5, 5, 0},
		[50] = {1, 5, 6, 0},
		[60] = {1, 5, 7, 0},
		[70] = {1, 5, 8, 0},
		[80] = {1, 5, 9, 0},
		[90] = {1, 5, 10, 0},
	},

}
