
-- ====================== 文件信息 ======================

-- 剑侠世界任务链地图点文件
-- Edited by peres
-- 2008/04/08 PM 10:39 圣诞节前夜

-- 很多事情不需要预测
-- 预测会带来犹豫
-- 因为心里会有恐惧

-- ======================================================

local _tbMap = {
	 {"野外地图", "铸剑坊", 44,1556,3509},
	 {"野外地图", "镇东墓园", 38,1569,3529},
	 {"野外地图", "岳阳楼", 45,1615,3823},
	 {"野外地图", "原始森林西部", 74,1875,3248},
	 {"野外地图", "原始森林东部", 64,1877,3246},
	 {"野外地图", "药王洞", 93,1913,3717},
	 {"野外地图", "燕子坞中段", 70,1612,2699},
	 {"野外地图", "燕子坞外围", 60,1612,2699},
	 {"野外地图", "雁荡龙湫", 36,1609,3943},
	 {"野外地图", "响水洞", 97,1720,3793},
	 {"野外地图", "西夏皇陵", 108,1670,3214},
	 {"野外地图", "潼关", 40,1816,3883},
	 {"野外地图", "天柱峰", 49,1613,3933},
	 {"野外地图", "天忍教禁地", 47,1661,3679},
	 {"野外地图", "天龙寺", 112,1907,3530},
	 {"野外地图", "太行古径", 86,1951,3913},
	 {"野外地图", "塔林西部", 66,1995,3287},
	 {"野外地图", "塔林东部", 56,1995,3287},
	 {"野外地图", "蜀南竹海", 42,2028,3430},
	 {"野外地图", "蜀冈山", 103,1802,3907},
	 {"野外地图", "沙漠迷宫", 101,1624,3877},
	 {"野外地图", "青螺岛", 55,1782,3788},
	 {"野外地图", "祁连山", 39,2035,3252},
	 {"野外地图", "彭蠡古泽", 99,1626,2442},
	 {"野外地图", "南夷部落", 54,1826,3204},
	 {"野外地图", "梅花岭", 33,1988,4048},
	 {"野外地图", "芦苇荡西北部", 75,1955,3770},
	 {"野外地图", "芦苇荡东南部", 65,1967,3716},
	 {"野外地图", "龙门石窟", 107,1988,3413},
	 {"野外地图", "龙门客栈", 31,2034,3550},
	 {"野外地图", "龙虎幻境西部", 69,1588,3170},
	 {"野外地图", "龙虎幻境东部", 59,1588,3170},
	 {"野外地图", "军马场", 32,1614,3957},
	 {"野外地图", "居延泽", 94,1786,3958},
	 {"野外地图", "九嶷溪", 106,1929,3324},
	 {"野外地图", "九老峰", 51,1776,3133},
	 {"野外地图", "九老洞一层", 61,1633,3823},
	 {"野外地图", "九老洞二层", 71,1633,3823},
	 {"野外地图", "金国皇陵一层", 57,1439,3485},
	 {"野外地图", "金国皇陵二层", 67,1439,3485},
	 {"野外地图", "荐菊洞", 110,1382,3279},
	 {"野外地图", "剑门关", 111,1948,3553},
	 {"野外地图", "剑阁蜀道", 104,1546,3717},
	 {"野外地图", "见性峰", 48,1875,3725},
	 {"野外地图", "鸡冠洞", 102,1594,3205},
	 {"野外地图", "黄鹤楼", 109,1604,3275},
	 {"野外地图", "浣花溪", 90,1969,3550},
	 {"野外地图", "淮水沙洲", 41,1977,3374},
	 {"野外地图", "虎丘剑池", 96,1798,3971},
	 {"野外地图", "湖畔竹林西部", 73,1774,3242},
	 {"野外地图", "湖畔竹林东部", 63,1774,3242},
	 {"野外地图", "后山禁地", 46,2006,3306},
	 {"野外地图", "汉水古渡", 88,1612,3227},
	 {"野外地图", "寒山古刹", 89,1528,3386},
	 {"野外地图", "古战场", 30,1623,4041},
	 {"野外地图", "姑苏水榭", 50,1828,3140},
	 {"野外地图", "伏牛山", 95,1759,3232},
	 {"野外地图", "风陵渡", 100,1974,3264},
	 {"野外地图", "翡翠湖", 53,1861,3207},
	 {"野外地图", "洱海摩岩", 91,1798,3829},
	 {"野外地图", "段氏皇陵", 105,1397,3544},
	 {"野外地图", "洞庭湖畔", 37,1788,3255},
	 {"野外地图", "点苍山", 98,1926,3801},
	 {"野外地图", "大散关", 87,1596,3382},
	 {"野外地图", "长江河谷", 34,1689,3407},
	 {"野外地图", "茶马古道", 43,1958,3830},
	 {"野外地图", "采石矶", 92,2069,3447},
	 {"野外地图", "冰穴迷宫一层", 58,1633,3368},
	 {"野外地图", "冰穴迷宫二层", 68,1633,3368},
	 {"野外地图", "帮源秘洞", 113,1893,3383},
	 {"野外地图", "百花阵外阵", 62,2378,3768},
	 {"野外地图", "百花阵内阵", 72,2379,3766},
	 {"野外地图", "百花谷", 52,1957,3738},
	 {"野外地图", "白族市集", 35,2024,3979},
	 
	 {"野外地图", "敕勒川", 114,1669,3788},
	 {"野外地图", "嘉峪关", 115,1440,3121},
	 {"野外地图", "华山", 116,1658,3425},
	 {"野外地图", "蜀岗秘境", 117,1548,3327},
	 {"野外地图", "丰都鬼城", 118,1554,3615},
	 {"野外地图", "苗岭", 119,1833,3727},
	 {"野外地图", "武夷山", 120,1744,3830},
	 {"野外地图", "武陵山", 121,1548,3327},	 
 }
 
 
LinkTask.tbMapPos	 = {};

for i=1, #_tbMap do
	local tbMapKey  = {_tbMap[i][2], _tbMap[i][4], _tbMap[i][5]};
	if (not LinkTask.tbMapPos[_tbMap[i][3]]) then
		LinkTask.tbMapPos[_tbMap[i][3]] = {};
	end;
	LinkTask.tbMapPos[_tbMap[i][3]] = tbMapKey;
end;