-- 文件名  : planting_def.lua
-- 创建者  : jiazhenwei
-- 创建时间: 2011-02-24 09:52:57
-- 描述    : 2011植树

SpecialEvent.tbZhiShu2011 = SpecialEvent.tbZhiShu2011 or {};
local tbZhiShu2011 = SpecialEvent.tbZhiShu2011;

tbZhiShu2011.TASKGID = 2153;
tbZhiShu2011.TASK_DATE				= 1;	--种树日期
tbZhiShu2011.TASK_COUNT_PLANT		= 2;	--每天种树的数目
tbZhiShu2011.TASK_GETITEM		 	= 3;	--获得道具的时间

tbZhiShu2011.nAttendMinLevel 	= 60;		--参加等级
tbZhiShu2011.nMaxPlant			= 51;		--每天每人可以种植50个希望之种子
tbZhiShu2011.nStartTime 		= 20110310;	--活动开始时间
tbZhiShu2011.nEndTime 			= 20110316;	--活动结束时间
tbZhiShu2011.nMinLevelForMsg	= 5;			--最低多少层发送家族好友公告
tbZhiShu2011.nTeamPlantNum	= 3;			--组队种树需要几个人

--种树npc
tbZhiShu2011.tbTree = {
	--NpcId, 浇水时间，死亡时间，生存时间，长大概率值（1-10000）,帮会家族摘取果实的数
	[1] = {7296, 1, 600, 30, 7500, 0},	--希望之苗(种子) 
	[2] = {7297, 1, 600, 30, 4200, 0}, 	--葱郁树苗
	[3] = {7298, 1, 600, 30, 2780, 0}, 	--青葱小树
	[4] = {7299, 1, 600, 30, 2200, 0}, 	--翠绿小树
	[5] = {7300,  1, 600, 3600, 1750, 5}, 	--芝兰玉树
	[6] = {7301,  1, 600, 3600, 1400, 10}, 	--暮云春树
	[7] = {7302,  1, 600, 24*3600, 0, 20}, 	--浮云神树
};

--树名字
tbZhiShu2011.tbTreeName = {"希望之苗","葱郁树苗", "青葱小树", "翠绿小树", "芝兰玉树", "暮云春树", "浮云神树"};

tbZhiShu2011.INDEX_BIG_TREE = #tbZhiShu2011.tbTree;		--最大树

--希望之种npc
tbZhiShu2011.tbXiWangNpc = {
	[1] = {7294, 600}, 	-- 希望之土
	[2] = {7295, 600},	-- 希望之种
	};

tbZhiShu2011.tbXiWangZhiZhong = {18,1,1197,1};	--希望之种

tbZhiShu2011.tbXiWangNeedItem = {{18,1,1194,1},{18,1,1195,1},{18,1,1196,1}};

tbZhiShu2011.tbXiWangMsg = {"需要希望之风的轻抚", "需要希望之水的灌溉", "希望之种培育出来了"};

tbZhiShu2011.tbTitle= {6,54,1,1};	--忽如一夜春风来

--每层奖励
tbZhiShu2011.tbAward = {
	[1] = {[1] = {}, [2] = {}},		--希望之苗（种子）
	[2] = {[1] = {{1, 450, "绑定金币"},{2,56600, "绑定银两"},{3, {18,1,114,5,nil,1}, "1个五级玄晶"}}, [2] = {}},		-- 葱郁树苗
	[3] = {[1] = {{1, 1675, "绑定金币"},{2,203800, "绑定银两"},{3, {18,1,114,6,nil,1}, "1个六级玄晶"}}, [2] = {}}, 		-- 青葱小树
	[4] = {[1] = {{1, 12225, "绑定金币"},{2,1467475, "绑定银两"},{3, {18,1,114,7,nil,2}, "2个七级玄晶"}}, [2] = {}}, 	-- 翠绿小树
	[5] = {[1] = {{1, 44000, "绑定金币"},{2,5282950, "绑定银两"},{3, {18,1,114,8,nil,2}, "2个八级玄晶"}}, [2] = {{1, 1000},{2,120000},{4, 60000, 500}}}, 		-- 芝兰玉树
	[6] = {[1] = {{1, 158475, "绑定金币"},{2,19018700, "绑定银两"},{3, {18,1,114,9,nil,2}, "2个九级玄晶"}}, [2] = {{1, 1000},{2,120000},{4, 60000, 500}}}, 	-- 暮云春树
	[7] = {[1] = {{1, 570550, "绑定金币"},{2,68467375, "绑定银两"},{3, {18,1,114,10,nil,2}, "2个十级玄晶"}}, [2] = {{1, 1000},{2,120000},{4, 60000, 500}}}, 	-- 浮云神树	
	};

tbZhiShu2011.tbAwardRate = {30, 70, 100};	--每种奖励的概率（金币，绑银，玄晶）

--每层的发送消息
tbZhiShu2011.tbMsgforOther = {
	[1] = {"浇水", "我感到很干燥，给我浇点水好吗?"},
	[2] = {"除虫", "好痒呀，有虫咬我，快给我除虫吧!"},
	[3] = {"施肥", "没有营养了，快给我施肥吧！"},
	}

--date table
tbZhiShu2011.tbPlantInfo = tbZhiShu2011.tbPlantInfo or {};		--种树标志{[nServerId]= {[szName] = 1}}
