
-- 临时Item模板

local tb = Item:GetClass("tempitem");

local _tbMap	= {
 {"战场", "战场报名点_宋(扬州一)", 181,1654,3314},
 {"战场", "战场报名点_宋(襄阳一)", 183,1654,3314},
 {"战场", "战场报名点_宋(凤翔一)", 182,1654,3314},
 {"战场", "战场报名点_金(扬州一)", 184,1654,3314},
 {"战场", "战场报名点_金(襄阳一)", 186,1654,3314},
 {"战场", "战场报名点_金(凤翔一)", 185,1654,3314},
 {"战场", "战场报名点_宋(扬州二)", 257,1654,3314},
 {"战场", "战场报名点_宋(襄阳二)", 259,1654,3314},
 {"战场", "战场报名点_宋(凤翔二)", 258,1654,3314},
 {"战场", "战场报名点_金(扬州二)", 260,1654,3314},
 {"战场", "战场报名点_金(襄阳二)", 262,1654,3314},
 {"战场", "战场报名点_金(凤翔二)", 261,1654,3314},
 {"战场", "蟠龙谷之战(扬州一)", 193,2335,3481},
 {"战场", "蟠龙谷之战(襄阳一)", 195,2335,3481},
 {"战场", "蟠龙谷之战(凤翔一)", 194,2335,3481},
 {"战场", "五丈原之战(扬州一)", 190,1767,2977},
 {"战场", "五丈原之战(襄阳一)", 192,1767,2977},
 {"战场", "五丈原之战(凤翔一)", 191,1767,2977},
 {"战场", "九曲之战(扬州一)", 187,1435,3748},
 {"战场", "九曲之战(襄阳一)", 189,1435,3748},
 {"战场", "九曲之战(凤翔一)", 188,1435,3748},
 {"战场", "蟠龙谷之战(扬州二)", 263,2335,3481},
 {"战场", "蟠龙谷之战(襄阳二)", 265,2335,3481},
 {"战场", "蟠龙谷之战(凤翔二)", 264,2335,3481},
 {"战场", "五丈原之战(扬州二)", 266,1767,2977},
 {"战场", "五丈原之战(襄阳二)", 268,1767,2977},
 {"战场", "五丈原之战(凤翔二)", 267,1767,2977},
 {"战场", "九曲之战(扬州二)", 269,1435,3748},
 {"战场", "九曲之战(襄阳二)", 271,1435,3748},
 {"战场", "九曲之战(凤翔二)", 270,1435,3748},
 {"战场", "战场报名点_宋(扬州三)", 282,1654,3314},
 {"战场", "战场报名点_金(扬州三)", 283,1654,3314},
 {"战场", "九曲之战(扬州三)", 284,1435,3748},
 {"战场", "五丈原之战(扬州三)", 285,1767,2977},
 {"战场", "蟠龙谷之战(扬州三)", 286,2335,3481},
 {"战场", "战场报名点_宋(凤翔三)", 288,1654,3314},
 {"战场", "战场报名点_金(凤翔三)", 289,1654,3314},
 {"战场", "九曲之战(凤翔三)", 290,1435,3748},
 {"战场", "五丈原之战(凤翔三)", 291,1767,2977},
 {"战场", "蟠龙谷之战(襄阳三)", 292,2335,3481},
 {"战场", "战场报名点_宋(襄阳三)", 293,1654,3314},
 {"战场", "战场报名点_金(襄阳三)", 294,1654,3314},
 {"战场", "九曲之战(襄阳三)", 295,1435,3748},
 {"战场", "五丈原之战(襄阳三)", 296,1767,2977},
 {"战场", "蟠龙谷之战(凤翔三)", 297,2335,3481},
 {"野外地图", "蒙古王庭", 130,1601,3721},
 {"野外地图", "月牙泉", 131,1938,3621},
 {"野外地图", "阿房宫废墟", 132,1572,3513},
 {"野外地图", "梁山泊", 133,1789,3739},
 {"野外地图", "神女峰", 134,1777,3194},
 {"野外地图", "夜郎旧墟", 135,1603,3687},
 {"野外地图", "鼓浪屿", 136,1588,3169},
 {"野外地图", "桃花源", 137,1848,3261},
 {"野外地图", "漠北草原", 122,1797,3757},
 {"野外地图", "敦煌古城", 123,1928,3366},
 {"野外地图", "活死人墓", 124,1734,3326},
 {"野外地图", "大禹台", 125,1750,3855},
 {"野外地图", "三峡栈道", 126,1523,3592},
 {"野外地图", "蚩尤洞", 127,1605,3227},
 {"野外地图", "锁云渊", 128,1935,3406},
 {"野外地图", "伏流洞", 129,1897,3586},
 {"野外地图", "敕勒川", 114,1669,3788},
 {"野外地图", "嘉峪关", 115,1440,3121},
 {"野外地图", "华山", 116,1658,3425},
 {"野外地图", "蜀岗秘境", 117,1548,3327},
 {"野外地图", "丰都鬼城", 118,1554,3615},
 {"野外地图", "苗岭", 119,1833,3727},
 {"野外地图", "武夷山", 120,1744,3830},
 {"野外地图", "武陵山", 121,1548,3327},
 {"野外地图", "铸剑坊", 44,1556,3509},
 {"野外地图", "镇东墓园", 38,1569,3529},
 {"野外地图", "岳阳楼", 45,1615,3823},
 {"野外地图", "原始森林西部", 74,1882,3234},
 {"野外地图", "原始森林东部", 64,1882,3234},
 {"野外地图", "药王洞", 93,1913,3717},
 {"野外地图", "燕子坞中段", 70,1612,2699},
 {"野外地图", "燕子坞外围", 60,1612,2699},
 {"野外地图", "雁荡龙湫", 36,1613,3938},
 {"野外地图", "响水洞", 97,1720,3793},
 {"野外地图", "西夏皇陵", 108,1670,3214},
 {"野外地图", "潼关", 40,1816,3883},
 {"野外地图", "天柱峰", 49,1618,3927},
 {"野外地图", "天忍教禁地", 47,1661,3679},
 {"野外地图", "天龙寺", 112,1913,3537},
 {"野外地图", "太行古径", 86,1951,3913},
 {"野外地图", "塔林西部", 66,1995,3287},
 {"野外地图", "塔林东部", 56,1995,3287},
 {"野外地图", "蜀南竹海", 42,2028,3430},
 {"野外地图", "蜀冈山", 103,1802,3907},
 {"野外地图", "沙漠迷宫", 101,1624,3877},
 {"野外地图", "青螺岛", 55,1926,3760},
 {"野外地图", "祁连山", 39,2035,3252},
 {"野外地图", "彭蠡古泽", 99,1626,2433},
 {"野外地图", "南夷部落", 54,1824,3201},
 {"野外地图", "梅花岭", 33,1988,4048},
 {"野外地图", "芦苇荡西北部", 75,1974,3724},
 {"野外地图", "芦苇荡东南部", 65,1974,3724},
 {"野外地图", "龙门石窟", 107,1968,3824},
 {"野外地图", "龙门客栈", 31,2034,3550},
 {"野外地图", "龙虎幻境西部", 69,1588,3170},
 {"野外地图", "龙虎幻境东部", 59,1588,3170},
 {"野外地图", "军马场", 32,1611,3966},
 {"野外地图", "居延泽", 94,1786,3958},
 {"野外地图", "九嶷溪", 106,1929,3324},
 {"野外地图", "九老峰", 51,1776,3133},
 {"野外地图", "九老洞一层", 61,1638,3828},
 {"野外地图", "九老洞二层", 71,1638,3828},
 {"野外地图", "金国皇陵一层", 57,1678,3237},
 {"野外地图", "金国皇陵二层", 67,1678,3237},
 {"野外地图", "荐菊洞", 110,1382,3279},
 {"野外地图", "剑门关", 111,1611,3269},
 {"野外地图", "剑阁蜀道", 104,1546,3717},
 {"野外地图", "见性峰", 48,1875,3725},
 {"野外地图", "鸡冠洞", 102,1599,3208},
 {"野外地图", "黄鹤楼", 109,1929,3545},
 {"野外地图", "浣花溪", 90,1963,3559},
 {"野外地图", "淮水沙洲", 41,1973,3377},
 {"野外地图", "虎丘剑池", 96,1798,3971},
 {"野外地图", "湖畔竹林西部", 73,1775,3241},
 {"野外地图", "湖畔竹林东部", 63,1775,3241},
 {"野外地图", "后山禁地", 46,2006,3306},
 {"野外地图", "汉水古渡", 88,1901,3335},
 {"野外地图", "寒山古刹", 89,1528,3386},
 {"野外地图", "古战场", 30,1623,4041},
 {"野外地图", "姑苏水榭", 50,1833,3140},
 {"野外地图", "伏牛山", 95,1603,3275},
 {"野外地图", "风陵渡", 100,1974,3264},
 {"野外地图", "翡翠湖", 53,1861,3207},
 {"野外地图", "洱海摩岩", 91,1975,3437},
 {"野外地图", "段氏皇陵", 105,1397,3544},
 {"野外地图", "洞庭湖畔", 37,1788,3255},
 {"野外地图", "点苍山", 98,1926,3801},
 {"野外地图", "大散关", 87,1596,3382},
 {"野外地图", "长江河谷", 34,1689,3407},
 {"野外地图", "茶马古道", 43,1958,3830},
 {"野外地图", "采石矶", 92,2069,3447},
 {"野外地图", "冰穴迷宫一层", 58,1633,3368},
 {"野外地图", "冰穴迷宫二层", 68,1633,3368},
 {"野外地图", "帮源秘洞", 113,1893,3383},
 {"野外地图", "百花阵外阵", 62,2378,3768},
 {"野外地图", "百花阵内阵", 72,2378,3768},
 {"野外地图", "百花谷", 52,1957,3738},
 {"野外地图", "白族市集", 35,2024,3979},
 {"新手村", "云中镇", 1,1389,3102},
 {"新手村", "永乐镇", 3,1693,3288},
 {"新手村", "石鼓镇", 6,1572,3106 },
 {"新手村", "龙泉村", 7,1510,3268},
 {"新手村", "龙门镇", 2,1785,3586},
 {"新手村", "江津村", 5,1597,3131},
 {"新手村", "稻香村", 4,1624,3253},
 {"新手村", "巴陵县", 8,1721,3381},
 {"新手村", "灵秀村", 2115, 1608, 3283},
 {"门派", "西夏一品堂", 13,1679,3292},
 {"门派", "武当派", 14,1435,2991},
 {"门派", "五毒教", 20,1574,3145},
 {"门派", "天王帮", 22,1663,3039},
 {"门派", "天忍教", 10,1658,3324},
 {"门派", "唐门", 18,1633,3179},
 {"门派", "少林派", 9,1702,3093},
 {"门派", "萨满教", 11,1645,3196},
 {"门派", "昆仑派", 12,1700,3080},
 {"门派", "丐帮", 15,1606,3245},
 {"门派", "峨嵋派", 16,1584,3041},
 {"门派", "大理段氏", 19,1618,3120},
 {"门派", "翠烟门", 17,1487,3093},
 {"门派", "长歌门", 21,1631,3404},
 {"门派", "明教", 224,1625,3181},
 {"门派", "古墓", 2261,1733,3054},
 {"擂台", "武林擂台(扬州)", 170,1646,3177},
 {"擂台", "武林擂台(襄阳)", 169,1646,3177},
 {"擂台", "武林擂台(临安)", 173,1646,3177},
 {"擂台", "武林擂台(凤翔)", 168,1646,3177},
 {"擂台", "武林擂台(大理)", 172,1646,3177},
 {"擂台", "武林擂台(成都)", 171,1646,3177},
 {"擂台", "武林擂台(汴京)", 167,1646,3177},
 {"擂台", "铁索栈桥(扬州)", 177,1608,3216},
 {"擂台", "铁索栈桥(襄阳)", 176,1608,3216},
 {"擂台", "铁索栈桥(临安)", 180,1608,3216},
 {"擂台", "铁索栈桥(凤翔)", 175,1608,3216},
 {"擂台", "铁索栈桥(大理)", 179,1608,3216},
 {"擂台", "铁索栈桥(成都)", 178,1608,3216},
 {"擂台", "铁索栈桥(汴京)", 174,1608,3216},
 {"城市", "扬州府", 26,1641,3129},
 {"城市", "襄阳府", 25,1630,3169},
 {"城市", "临安府", 29,1605,3946},
 {"城市", "凤翔府", 24,1767,3540},
 {"城市", "大理府", 28,1439,3366},
 {"城市", "成都府", 27,1666,3260},
 {"城市", "汴京府", 23,1486,3179},
};

tb.tbItems	= {
	"任务道具",
	{
		{
			"字母b",
			{	
				{"白蛇蛋",				79},
				{"百验灵药",			355},
				{"斑斑",				316},
				{"帮源秘洞的地图",		389},
				{"帮源秘洞粮食",		395},
				{"帮源秘洞武器",		394},
				{"宝箱钥匙",			126},
				{"宝箱钥匙",			148},
				{"宝箱钥匙",			393},
				{"北方旗帜",			76},
				{"被夺的玉钗",			94},
				{"被劫的贡品",			329},
				{"被劫的粮草",			48},
				{"被劫的细软",			49},
				{"避蛊草",				370},
				{"汴京测天台",			381},
				{"卜算子",				361},
				{"不动先生的烟火",		406},
				{"怖者之枪",			7},
			}
		},
		{
			"字母c",
			{
				{"藏宝图碎片",			1158},
				{"藏宝图碎片2",			159},
				{"藏宝图碎片3",			160},
				{"藏宝图碎片4",			161},
				{"草料",				123},
				{"超度亡魂经",			141},
				{"沉甸甸的银袋",		22},
				{"陈年烈酒",			187},
				{"陈年竹叶青",			70},
				{"出宫记录",			310},
				{"春绝心法",			63},
				{"雌雄双剑",			103},
				{"匆匆扎成的纸人",		352},
				{"脆脆糕点",			311},
			}
		},
		{
			"字母d",
			{
				{"大戒禅师的书信",		124},
				{"大理测天台",			382},
				{"大内信符",			87},
				{"大青蔸",				33},
				{"道士的衣服",			400},
				{"灯煞口新到的信笺",	165},
				{"滴水洞地图",			150},
				{"地图画册",			12},
				{"地穴钥匙",			2},
				{"蝶飘飘的手令",		168},
				{"东方旗帜",			73},
				{"东坡诗集注",			186},
				{"洞天玉简",			375},
				{"毒火草",				135},
				{"毒药",				115},
				{"毒医的来历",			55},
			}
		},
		{
			"字母e~f",
			{
				{"娥皇之歌",			23},
				{"峨嵋人物书录",		54},
				{"二队的桩子",			338},
				{"废庙钥匙",			39},
				{"风信子",				18},
				{"凤翔测天台",			384},
				{"凤眼珠碎片",			147},
				{"符笔",				349},
				{"符水",				114},
				{"符纸",				350},
				{"福隆草",				366},
				{"腹蛇皮",				179},
			}
		},
		{
			"字母g",
			{
				{"郜楠的玉佩",			108},
				{"格西的命令",			336},
				{"给黑虎的密函",		397},
				{"给裘止水的书信",		136},
				{"给石轩辕的书信",		137},
				{"给小显的信",			120},
				{"勾结密信",			356},
				{"古剑长青",			29},
				{"古剑无痕",			175},
				{"古琴",				399},
				{"古书善本",			358},
				{"蛊女手书",			371},
				{"关卡1新到的信笺",		162},
				{"关卡2新到的信笺",		163},
				{"关卡3新到的信笺",		164},
				{"果篮",				132},
			}
		},
		{
			"字母h",
			{
				{"韩府金腰牌",			98},
				{"韩忠说的密函",		322},
				{"汗血宝马",			205},
				{"好毒好毒的草",		354},
				{"合欢花",				192},
				{"黑狗血",				95},
				{"黑虎写好的推荐信",	398},
				{"黑龙缠",				185},
				{"黑衣人",				203},
				{"红棉花",				72},
				{"猴儿酒",				9},
				{"猴肉",				409},
				{"蝴蝶草",				143},
				{"虎皮",				197},
				{"虎肉",				411},
				{"皇榜",				97},
				{"黄鹤楼的形势图",		130},
				{"黄狼骨",				151},
				{"黄铜钥匙丙",			27},
				{"黄铜钥匙甲",			25},
				{"黄铜钥匙乙",			26},
				{"火器谱",				71},
				{"火桩",				347},
			}
		},
		{
			"字母j",
			{
				{"机关枢纽",			116},
				{"机要手札",			83},
				{"极乐丹",				402},
				{"极乐丸",				342},
				{"嫁衣草",				312},
				{"剑冢信符",			301},
				{"剑冢印信",			306},
				{"姜三的首级",			58},
				{"交往账簿",			391},
				{"接筋续脉散",			180},
				{"接引弟子的锦囊",		407},
				{"接引使的备忘录",		404},
				{"解毒药",				318},
				{"金刚禅杖（开光）",	36},
				{"金刚禅杖（未开光）",	35},
				{"金刚经",				140},
				{"金国人的头颅",		153},
				{"金矿石",				90},
				{"金丝绣袋",			189},
				{"金桩",				344},
				{"九节菖蒲",			32},
				{"酒窖钥匙",			335},
				{"绝密情报",			332},
				{"掘冰之炉",			62},
				{"军籍卷册",			309},
				{"军营中发现的符咒",	396},
				{"军用物资",			96},
			}
		},
		{
			"字母k",
			{
				{"客人的包袱",			204},
				{"空白纸张",			379},
				{"空瓶",				313},
				{"寇锐的解药",			300},
				{"骷髅飞翅马旗",		93},
				{"苦神雕像",			111},
				{"矿洞机关的钥匙",		101},
			}
		},
		{
			"字母l",
			{
				{"蜡封的信筒",			134},
				{"兰松林的印鉴",		170},
				{"老者书信",			177},
				{"李阿大的首级",		80},
				{"李升阳面具",			365},
				{"连根草",				178},
				{"梁项林的头颅",		363},
				{"临安测天台",			380},
				{"灵封古镜",			319},
				{"灵魂的火焰",			125},
				{"灵芝",				37},
				{"六畜不宁散（临安）",	385},
				{"六畜不宁散（襄阳）",	387},
				{"六畜不宁散（扬州）",	386},
				{"龙珠",				146},
				{"卢笑贫的家书",		191},
				{"鹿茸",				196},
				{"鹿肉",				315},
				{"路晓然交付的包袱",	42},
				{"路晓然交付的信函",	41},
				{"绿蝮蛇胆",			367},
				{"绿闪儿花",			167},
				{"绿玉如意",			305},
				{"罗锋的信笺",			78},
				{"罗盘",				199},
				{"罗盘2",				209},
				{"罗盘3",				210},
				{"罗盘4",				211},
				{"罗小虎的骸骨",		326},
				{"罗小英的骸骨",		327},
			}
		},
		{
			"字母m",
			{
				{"马贼令牌",			173},
				{"猫食盆",				317},
				{"毛笔",				10},
				{"麋鹿骨",				152},
				{"麋鹿肉",				410},
				{"秘法血咒",			91},
				{"秘密计划书",			88},
				{"秘密军令",			122},
				{"秘密名单",			127},
				{"密封的资料",			113},
				{"密诏",				112},
				{"名人字画",			359},
				{"模糊不清的人头",		331},
				{"莫岐萧清芳的首级",	119},
				{"木人零件",			40},
				{"木人阵钥匙",			303},
				{"木桩",				345},
				{"慕容氏长剑",			52},
			}
		},
		{
			"字母n~r",
			{
				{"南方旗帜",			74},
				{"女祭司心脏",			84},
				{"女人的骨殖",			77},
				{"女巫头发",			24},
				{"皮罗阁的头颅",		86},
				{"破旧的羊皮纸上",		105},
				{"破旧的羊皮纸下",		106},
				{"七宝琉璃",			50},
				{"七星枪谱",			138},
				{"亲子盆",				128},
				{"秦相人的首级",		61},
				{"青冥宝剑",			44},
				{"青冥剑套",			45},
				{"囚犯名册",			46},
				{"囚房钥匙",			321},
				{"裘止水的信",			4},
				{"如意的嫁妆",			190},
			}
		},
		{
			"字母s",
			{
				{"洒云手",				64},
				{"三队的桩子",			339},
				{"散乱的琴谱",			403},
				{"沙漠迷宫地图",		117},
				{"山药",				31},
				{"商代刀币",			51},
				{"神秘的手帕",			109},
				{"神秘家书",			408},
				{"神医开出的解药",		369},
				{"尸体上搜到的东西",	307},
				{"尸芋花",				401},
				{"石碑",				19},
				{"石像机关",			174},
				{"势力分布图",			374},
				{"释迦牟尼的舍利子",	121},
				{"释者斗笠",			38},
				{"书页",				66},
				{"帅印",				89},
				{"双首的肉",			360},
				{"水桩",				346},
				{"丝线",				34},
				{"四队的桩子",			340},
				{"四方雕像",			201},
				{"四方雕像2",			212},
				{"四方雕像3",			213},
				{"四方雕像4",			214},
				{"宋朝的首级",			59},
				{"随风的信符",			405},
			}
		},
		{
			"字母t",
			{
				{"唐如的礼物",			67},
				{"逃犯的银票",			176},
				{"逃跑的和尚",			183},
				{"桃花剑说的银子",		390},
				{"天目道长的信",		188},
				{"天忍秘令",			184},
				{"天忍小旗",			1},
				{"天王帮服装",			323},
				{"天王帮腰牌",			171},
				{"天王分舵来信",		133},
				{"天竺僧人的骨骸",		107},
				{"铁箱钥匙",			328},
				{"铜镜",				353},
				{"铜镜机关",			202},
				{"铜镜机关2",			215},
				{"铜镜机关3",			216},
				{"铜镜机关4",			217},
				{"土茯苓",				30},
				{"土桩",				348},
			}
		},
		{
			"字母w",
			{
				{"亡灵超度符",			110},
				{"忘忧草",				15},
				{"忘忧丹解药",			92},
				{"伪造的联络信函",		5},
				{"未署名信笺",			169},
				{"温润草",				181},
				{"钨金长剑",			47},
				{"无名小草",			320},
				{"五毒教旗标",			14},
				{"五队的桩子",			341},
				{"五行书",				413},
				{"武林高手的尸骨",		155},
			}
		},
		{
			"字母x",
			{
				{"西方旗帜",			75},
				{"西瓜",				8},
				{"细作名册",			53},
				{"涎香香囊",			21},
				{"香火",				82},
				{"橡实",				182},
				{"销石散",				324},
				{"小蛮给的烟花",		333},
				{"小舌草",				157},
				{"写满符咒的符纸",		351},
				{"谢飞的首级",			60},
				{"谢雨田的书信",		28},
				{"心意之间",			65},
				{"信符",				343},
				{"信鸽",				330},
				{"信使的日志",			334},
				{"星星草",				17},
				{"雄胆草",				3},
				{"熊肉",				412},
				{"熊掌",				198},
				{"宣纸",				11},
				{"悬赏告示",			373},
				{"血淋漓的耳朵",		357},
			}
		},
		{
			"字母y",
			{
				{"烟火",				145},
				{"烟火2_外冢",			206},
				{"烟火3_外冢",			207},
				{"烟火4_外冢",			208},
				{"眼镜蛇药",			172},
				{"燕小六的遗书",		131},
				{"燕子坞地图",			149},
				{"扬州测天台",			383},
				{"阳符",				69},
				{"瑶山部男子首级",		20},
				{"叶龙涎的首级",		56},
				{"夜光杯",				364},
				{"夜明珠",				102},
				{"一队的桩子",			337},
				{"一封书函",			85},
				{"一万两银子",			142},
				{"一张纸条(九十九)",	104},
				{"阴符",				68},
				{"银蟾腰牌",			154},
				{"银票",				129},
				{"影者暗记",			13},
				{"游龙珏",				200},
				{"游龙珏",				325},
				{"愚叟密函",			302},
				{"榆钱",				6},
				{"玉佛",				376},
				{"玉简译文",			378},
				{"玉髓飞凤",			392},
				{"喻婆婆的枕头",		81},
				{"御赐折扇",			308},
				{"御用器具",			372},
			}
		},
		{
			"字母z",
			{
				{"贼穴藏珍",			304},
				{"张生的头颅",			362},
				{"真人胡须",			43},
				{"纸和笔",				388},
				{"朱光照的首级",		57},
				{"朱红丹",				166},
				{"朱红果",				156},
				{"朱熹的亲笔信",		100},
				{"装满灵泉的瓶子",		314},
				{"装有奇怪粉末的瓶子",	368},
				{"捉到的醉汉",			144},
				{"紫罗兰",				16},
				{"紫星牡丹",			139},
				{"紫玉冰蛇",			118},
				{"紫玉矿石",			99},
			}
		},
	}
};

local _tbSkillItems	= {
	{"手",		{1,1,1,1,1,0,255,nil,0,0}},
	{"剑",		{1,1,2,1,1,0,255,nil,0,0}},
	{"刀",		{1,1,3,1,1,0,255,nil,0,0}},
	{"棍",		{1,1,4,1,1,0,255,nil,0,0}},
	{"枪",		{1,1,5,1,1,0,255,nil,0,0}},
	{"锤",		{1,1,6,1,1,0,255,nil,0,0}},
	{"飞镖",	{1,2,1,1,1,0,255,nil,0,0}},  
	{"飞刀",	{1,2,2,1,1,0,255,nil,0,0}},  
	{"袖箭",	{1,2,3,1,1,0,255,nil,0,0}},  
};

local _tbHorseItems	= {
	{
		{"马牌（枣红马）",		{1,12,1,1}},
		{"马牌（青马）",		{1,12,2,1}},
		{"马牌（大宛马）",		{1,12,3,2}},
		{"马牌（乌骓）",		{1,12,4,2}},
		{"马牌（乌云踏雪）",	{1,12,5,3}},
		{"马牌（的卢）",		{1,12,6,3}},
	},
	{
		{"马牌（绝影）",		{1,12,7,3}},
		{"马牌（照夜玉狮子）",	{1,12,8,3}},
		{"马牌（汗血宝马）",	{1,12,9,3}},
		{"马牌（赤兔）",		{1,12,10,4}},
		{"马牌（奔宵）",		{1,12,11,4}},
		{"马牌（翻羽）",		{1,12,12,4}},
	},
};

tb.tbMap	= {};
for _, tbPos in ipairs(_tbMap) do
	local tbMap	= tb.tbMap[tbPos[1]];
	if (not tbMap) then
		tbMap	= {};
		tb.tbMap[tbPos[1]]	= tbMap;
	end;
	tbMap[tbPos[2]]	= {unpack(tbPos, 2)};
end;

function tb:OnUse()
	if (it.nParticular == 3) then
		self:OnTransPak(self.tbMap);
	elseif (it.nParticular == 4) then
		self:OnSkillPak();
	elseif (it.nParticular == 12) then
		self:OnTaskItemPak(self.tbItems);
	end
	return 0;
end;

function tb:OnTransPak(tbPosTb, szFrom)
	if (type(tbPosTb[1]) == "string") then
		local nRet, szMsg = Map:CheckTagServerPlayerCount(tbPosTb[2])
		if nRet ~= 1 then
			me.Msg(szMsg);
			return 0;
		end
		me.Msg(string.format("坐好了，%s！(%d,%d,%d)",unpack(tbPosTb)));
		me.NewWorld(unpack(tbPosTb,2));
		return;
	end;
	local tbOpt	= {};
	local nCount	= 9;
	for szName, tbPos in next, tbPosTb, szFrom do
		if (nCount <= 0) then
			tbOpt[#tbOpt]	= {"Trang sau", self.OnTransPak, self, tbPosTb, tbOpt[#tbOpt-1][1]};
			break;
		end;
		tbOpt[#tbOpt+1]	= {szName, self.OnTransPak, self, tbPos};
		nCount	= nCount - 1;
	end;
	local tbGMItem = Item:GetClass("gmcard");
	tbOpt[#tbOpt+1]	= {"GM卡功能", tbGMItem.OnUse, tbGMItem};
	tbOpt[#tbOpt+1]	= {"Kết thúc đối thoại"};
	Dialog:Say("想去哪就去哪！<pic=48>", tbOpt);
end;

function tb:OnSkillPak()
	Dialog:Say("学了技能，无所不能！<pic=20>", {
		{"提升至130级！", self.LevelUp, self},
		{"获得装备道具物品", self.OpenItemAssit, self},
		--{"各类武器（满足技能的武器限制）", self.SelectItem, self},
		{"退出门派 & 清除技能 & 洗潜能点", self.ClearCall, self},
		{"加入门派", "Npc.tbMenPaiNpc:FactionDialog", Npc.tbMenPaiNpc.DialogMaster},
		{"学习所有生活技能", self.AddLifeSkill, self},
		(me.nFightState == 1 and {"取消战斗状态", me.SetFightState, 0}) or {"进入战斗状态", me.SetFightState, 1},
		--{"获得马牌", self.SelectHorse, self, 1},
		{"获得10个九转续命丸",self.AddItemJiuzhuan,self},
		{"丢弃背包里所有道具",me.ThrowAllItem},
		{"Kết thúc đối thoại"},
	});
end;

function tb:OnTaskItemPak(tbItems, nFrom)
	if (type(tbItems[2]) == "number") then
		Dialog:AskNumber(string.format("多少个[%s]？", tbItems[1]), 1, 100, self._OnAskItem, self, me, tbItems);
		me.Msg("如果此时您的客户端不能正确显示数字输入框，请直接按回车，默认获得一个！");
		return;
	end;
	local tbOpt	= {};
	local nCount	= 9;
	for nIndex = nFrom or 1, #tbItems[2] do
		if (nCount <= 0) then
			tbOpt[#tbOpt]	= {"Trang sau", self.OnTaskItemPak, self, tbItems, nIndex};
			break;
		end;
		tbOpt[#tbOpt+1]	= {tbItems[2][nIndex][1], self.OnTaskItemPak, self, tbItems[2][nIndex]};
		nCount	= nCount - 1;
	end;
	tbOpt[#tbOpt+1]	= {"Kết thúc đối thoại"};
	Dialog:Say("无尽的任务，不了的情缘~<pic=11>\n请选择你需要的任务道具。", tbOpt);
end;

function tb:LevelUp()
	ST_LevelUp(130-me.nLevel);
	Timer:Register(18, self._OnTimer, self);
end;

function tb:SelectItem()
	local tbOpt	= {};
	for _, tbItem in pairs(_tbSkillItems) do
		tbOpt[#tbOpt+1]	= {tbItem[1], Item.AddPlayerItem, me, unpack(tbItem[2])};
	end;
	tbOpt[#tbOpt+1]	= {"Kết thúc đối thoại"};
	Dialog:Say("你想要哪类武器啊<pic=44>", tbOpt);
end;

function tb:SelectHorse(nPageIdx)
	local tbOpt	= {};
	for _, tbItem in pairs(_tbHorseItems[nPageIdx]) do
		tbItem[2][8]	= 0;
		tbOpt[#tbOpt+1]	= {tbItem[1], Item.AddPlayerItem, me, unpack(tbItem[2])};
	end;
	if (nPageIdx == 1) then
		tbOpt[#tbOpt+1]	= {"下一页>>", self.SelectHorse, self, 2};
	else
		tbOpt[#tbOpt+1]	= {"<<上一页", self.SelectHorse, self, 1};
	end
	tbOpt[#tbOpt+1]	= {"Kết thúc đối thoại"};
	Dialog:Say("你想要个什么马牌呢<pic=44>", tbOpt);
end;

function tb:SelectHorse(nPageIdx)
	local tbOpt	= {};
	for _, tbItem in pairs(_tbHorseItems[nPageIdx]) do
		tbOpt[#tbOpt+1]	= {tbItem[1], Item.AddPlayerItem, me, unpack(tbItem[2])};
	end;
	if (nPageIdx == 1) then
		tbOpt[#tbOpt+1]	= {"下一页>>", self.SelectHorse, self, 2};
	else
		tbOpt[#tbOpt+1]	= {"<<上一页", self.SelectHorse, self, 1};
	end
	tbOpt[#tbOpt+1]	= {"Kết thúc đối thoại"};
	Dialog:Say("你想要个什么马牌呢<pic=44>", tbOpt);
end;

function tb:ClearCall()
	me.ResetFightSkillPoint();
	me.JoinFaction(0);
	me.SetTask(2,1,1);
	me.UnAssignPotential();
	me.Msg("你已沦为肉鸡！");
end;

function tb:OpenItemAssit()
	me.CallClientScript({"UiManager:OpenWindow", "UI_ITEM_ASSIT"});
end;

function tb:AddLifeSkill()
	for i = 1, 10 do
		LifeSkill:AddLifeSkill(me, i, 1);
	end;
	for i=1,23 do
		LifeSkill:AddSkillExp(me, i, 3000000);
	end
	me.Msg("你已无所不能！");
end;

function tb:_OnTimer()
	me.RestoreMana();
	me.RestoreLife();
	me.RestoreStamina();
	return 0;
end;

function tb:_OnAskItem(pPlayer, tbItem, nCount)
	pPlayer.Msg(string.format("收好了，%s x %d！(20,1,%d,1)", tbItem[1], nCount, tbItem[2]));
	for i = 1, nCount do
		pPlayer.AddQuest(1, tbItem[2], 1);
	end;
end;

function tb:AddItemJiuzhuan()
	for i = 1, 10 do
		Item.AddPlayerItem(me,18,1,24,1);
	end;
end;

function Item.AddPlayerItem(pPlayer, nGenre, nDetail, nParticular, nLevel, nSeries, nEnhTimes, nLucky, nVersion, uRandSeed)

	return	KItem.AddPlayerItem(
		pPlayer,
		nGenre,
		nDetail,
		nParticular,
		nLevel,
		nSeries or Env.SERIES_NONE,
		nEnhTimes or 0,
		nLucky or 0,
		nil,nil,
		nVersion or 0,
		uRandSeed or 0
	);

end
