-- 文件名　：wldh_award_def.lua
-- 创建者　：sunduoliang
-- 创建时间：2009-09-21 16:57:33
-- 描  述  ：

--奖励阶段
Wldh.AWARD_HONOR_STEP = {
	--门派单人赛
	[1] = {
		step	={	 1,	   2,	 3,	   4,	10,	  50,  100,  200,240000},
		honor	={5000, 4500, 4000, 3500, 3000, 2000, 1500, 1200, 1000},
	},
	--混合双人赛
	[2] = {
		step	={	 1,	   2,	 3,	   4,	10,	  50,  100,  200,  500, 1000,240000},
		honor	={5000, 4800, 4700, 4600, 4500, 3500, 3000, 2000, 1500, 1200, 1000},	
	},
	--混合三人赛
	[3] = {
		step	={	 1,	   2,	 3,	   4,	10,	  50,  100,  200,  500,240000},
		honor	={5000, 4800, 4600, 4500, 4000, 3000, 2500, 2000, 1500, 1200},
	},
	--五行五人赛
	[4] = {
		step	={	 1,	   2,	 3,	   4,	10,	  40,  100,  200,  400,240000},
		honor	={5000, 4800, 4700, 4600, 4000, 3000, 2000, 1500, 1200, 1000},
	},
};

Wldh.AWARD_FINISH_LIST = {
	[1] = {
		{
			nRank 	 = 1,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},48,0,0},
				},
			factiontitle={11,1,1},
		},
		{
			nRank 	 = 2,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},32,0,0},
				},
			factiontitle={11,1,2},
		},		
		{
			nRank 	 = 3,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},16,0,0},
				},
			factiontitle={11,1,3},
		},	
		{
			nRank 	 = 4,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},16,0,0},
				},
			factiontitle={11,1,4},
		},				
		{
			nRank 	 = 8,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},8,0,0},
				},
			factiontitle={11,1,5},
		},		
		{
			nRank 	 = 16,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},4,0,0},
				},
			factiontitle={11,1,6},
		},
		{
			nRank 	 = 32,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},2,0,0},
				},
			factiontitle={11,1,7},
		},
		{
			nRank 	 = 200000,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,488,1},1,1,0},
				},
		},							
	},
	[2] = {
		{
			nRank 	 = 1,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},48,0,0},
				},
			title={11,2,1,0},
		},
		{
			nRank 	 = 2,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},32,0,0},
				},
			title={11,2,2,0},
		},		
		{
			nRank 	 = 3,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},16,0,0},
				},
			title={11,2,3,0},
		},
		{
			nRank 	 = 4,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},16,0,0},
				},
			title={11,2,4,0},
		},					
		{
			nRank 	 = 8,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},8,0,0},
				},
			title={11,2,5,0},
		},		
		{
			nRank 	 = 16,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},4,0,0},
				},
			title={11,2,6,0},
		},
		{
			nRank 	 = 32,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},2,0,0},
				},
			title={11,2,7,0},
		},
		{
			nRank 	 = 200000,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,488,1},1,1,0},
				},
		},									
	},
	[3] = {
		{
			nRank 	 = 1,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},48,0,0},
				},
			title={11,3,1,0},
		},
		{
			nRank 	 = 2,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},32,0,0},
				},
			title={11,3,2,0},
		},		
		{
			nRank 	 = 3,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},16,0,0},
				},
			title={11,3,3,0},
		},	
		{
			nRank 	 = 4,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},16,0,0},
				},
			title={11,3,4,0},
		},				
		{
			nRank 	 = 8,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},8,0,0},
				},
			title={11,3,5,0},
		},		
		{
			nRank 	 = 16,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},4,0,0},
				},
			title={11,3,6,0},
		},
		{
			nRank 	 = 32,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},2,0,0},
				},
			title={11,3,7,0},
		},
		{
			nRank 	 = 200000,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,488,1},1,1,0},
				},
		},									
	},
	[4] = {
		{
			nRank 	 = 1,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},48,0,0},
				},
			title={11,4,1,0},
		},
		{
			nRank 	 = 2,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},32,0,0},
				},
			title={11,4,2,0},
		},		
		{
			nRank 	 = 3,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},16,0,0},
				},
			title={11,4,3,0},
		},
		{
			nRank 	 = 4,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},16,0,0},
				},
			title={11,4,4,0},
		},				
		{
			nRank 	 = 8,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},8,0,0},
				},
			title={11,4,5,0},
		},		
		{
			nRank 	 = 16,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},4,0,0},
				},
			title={11,4,6,0},
		},
		{
			nRank 	 = 32,
			nNeedBag = 1,
			item = 
				--物品，数量，绑定，有效期
				{
					{{18,1,487,1},2,0,0},
				},
			title={11,4,7,0},
		},
		{
			nRank 	 = 200000,
			nNeedBag = 1,
			item =
				--物品，数量，绑定，有效期
				{
					{{18,1,488,1},1,1,0},
				},
		},									
	},
}

Wldh.AWARD_FINISH_TITLE_LIST =
{
   [1]	=	{1	,13 ,25	,37	,49	,61	,73	},	-- 大会少林
   [2]  =   {2  ,14 ,26 ,38 ,50 ,62	,74	},	-- 大会天王
   [3]  =   {3  ,15 ,27 ,39 ,51 ,63	,75	},	-- 大会唐门
   [4]  =   {4  ,16 ,28 ,40 ,52 ,64	,76	},	-- 大会五毒
   [11] =   {5  ,17 ,29 ,41 ,53 ,65	,77	},	-- 大会明教
   [6]  =   {6  ,18 ,30 ,42 ,54 ,66	,78	},	-- 大会翠烟
   [5]  =   {7  ,19 ,31 ,43 ,55 ,67	,79	},	-- 大会峨嵋
   [12] =   {8  ,20 ,32 ,44 ,56 ,68	,80	},	-- 大会大理
   [7]  =   {9  ,21 ,33 ,45 ,57 ,69	,81	},	-- 大会丐帮
   [8]  =   {10 ,22 ,34 ,46 ,58 ,70 ,82 },	-->大会天忍
   [9]  =   {11 ,23 ,35 ,47 ,59 ,71 ,83 },	-->大会武当
   [10] =   {12 ,24 ,36 ,48 ,60 ,72 ,84 },	-->大会昆仑
};
