-------------------------------------------------------
-- 文件名　：marry_talk.lua
-- 创建者　：zhangjinpin@kingsoft
-- 创建时间：2010-01-05 01:26:15
-- 文件描述：
-------------------------------------------------------

Require("\\script\\marry\\logic\\marry_def.lua");

if (not MODULE_GAMESERVER) then
	return 0;
end

Marry.tbNpcTalk = 
{
	[1] = 
	{
		[6500] = 
		{
			[1] = {"朕到了，朕到了，众位爱卿平身。"},
			[2] = {"今天是%s和%s大的日子", 1},
			[3] = {"朕在百忙之中来到此地为他二人御赐典礼，"},
			[4] = {"希望他们在今后的日子里，"},
			[5] = {"欢欢喜喜，快快乐乐，"},
			[6] = {"平平安安，和和睦睦"},
			[7] = {"海枯石烂同心永结，"},
			[8] = {"地阔天高比翼齐飞！"},
			[9] = {"记住，我很看好你们啊。"},
		},
		[6501] = 
		{
			[1] = {"老身腿脚不灵便了。"},
			[2] = {"来迟了一步，希望二位侠侣见谅。"},
			[3] = {"说点啥呢？"},
			[4] = {"男人啊，多理解女人，做女人的，不容易。"},
			[5] = {"女人啊，和婆婆好好相处，相夫教子。"},
			[6] = {"百年恩爱双心结"},
			[7] = {"千里姻缘一线牵！"},
			[8] = {"惜缘，惜缘！"},
		},
		[6502] = 
		{
			[1] = {"今天，艳阳高照，天赐良缘。"},
			[2] = {"高朋满座，同贺新禧！"},
			[3] = {"在今天的大喜日子里"},
			[4] = {"我谨代表枢密院，翰林院各位首长，"},
			[5] = {"向两位侠侣表示热烈地祝贺和美好地祝愿。"},
			[6] = {"衷心地希望你们，在今后的日子里，"},
			[7] = {"能够勤奋工作、互敬互爱、"},
			[8] = {"孝敬老人、关爱孩子，"},
			[9] = {"事业红红火火，家庭甜甜蜜蜜。"},
			[10] = {"谢谢！ "},
		},
		[6503] = 
		{
			[1] = {"今天是一个大喜的日子，"},
			[2] = {"今天是一个温馨的日子，"},
			[3] = {"对二位侠侣来讲，今天更是一个终身难忘的日子。"},
			[4] = {"用你们幽深的明眸去解读无垠的平原，"},
			[5] = {"用你们美好的理想去畅游青春的蓝天；"},
			[6] = {"用你们轻盈的脚步去趟绿美丽生活的芳草园！"},
			[7] = {"用你们披荆斩棘的英姿去搏击人生路上的烦恼，"},
			[8] = {"用你们无私的爱去温馨父母夕阳般的暮年。"},
			[9] = {"年轻真好！"},
		},
		[6504] = 
		{
			[1] = {"因为你的到来，"},
			[2] = {"寂寞孤独悄然离去；"},
			[3] = {"因为你的到来，"},
			[4] = {"充实欢乐骤然而至！"},
			[5] = {"祝你们共享爱情，"},
			[6] = {"共擎风雨，白头偕老。"},
			[7] = {"祝你们青春美丽，"},
			[8] = {"人生美好，生命无憾！"},
			[9] = {"今天在二位步入神圣殿堂的时候，"},
			[10] = {"我代表各位来宾衷心地祝福你们"},
			[11] = {"幸福美满，天长地久。"},
		},
		[6505] = 
		{
			[1] = {"这是一个浪漫的季节，"},
			[2] = {"大侠女侠拥有了一个温馨的爱之甜梦；"},
			[3] = {"这是一个醉人的时刻，"},
			[4] = {"大侠女侠迎来了一个幸福而热烈的春天！"},
			[5] = {"为了这一季节的到来，"},
			[6] = {"鲜花含笑更鲜艳；"},
			[7] = {"为了这一时刻的到来，"},
			[8] = {"今夜星光更灿烂！"},
			[9] = {"祝福二位侠侣有情人终成眷属，"},
			[10] = {"感谢所有关心和爱护你们的人。"},
		},
		[6506] = 
		{
			[1] = {"俗话说：有缘千里来相会。"},
			[2] = {"由于出类拔萃，因此，一经相遇，"},
			[3] = {"就一见钟情，一看倾心，"},
			[4] = {"俩颗真诚的心撞在了一起，"},
			[5] = {"闪烁出爱情的火花。"},
			[6] = {"他们相遇了，他们志同道合，"},
			[7] = {"他们的结合是天生一对，地作一双。"},
			[8] = {"在他们新的生活即将开始的时候，"},
			[9] = {"我希望大侠、女侠互谅所短，互见所长，"},
			[10] = {"真情不渝，幸福无疆。"},
		},
		[6507] = 
		{
			[1] = {"小子们，老夫来也。"},
			[2] = {"愿你们侠侣恩爱，白头偕老。"},
			[3] = {"一朝结下千种爱，"},
			[4] = {"百岁不移半寸心。"},
			[5] = {"在漫漫人生路上"},
			[6] = {"相依相伴，相濡以沫，"},
			[7] = {"休戚与共，风雨同舟。"},
			[8] = {"任务那边还需要我，"},
			[9] = {"赶时间，先闪了！"},
		},
		[6508] = 
		{
			[1] = {"让我们为幸福起舞，"},
			[2] = {"为快乐的爱侣歌唱，"},
			[3] = {"为火热的爱情举杯，"},
			[4] = {"愿他们的人生之路永远洒满爱的阳光，"},
			[5] = {"吃尽天下美味不要浪费，"},
			[6] = {"喝尽人间美酒不要喝醉。"},
			[7] = {"吃好，喝好，大家好！。"},
		},
		[6509] = 
		{
			[1] = {"两情若是长久时，"},
			[2] = {"又岂在朝朝暮暮。"},
			[3] = {"只要真情纯洁，"},
			[4] = {"花开花谢就永好；"},
			[5] = {"只要情真意切，"},
			[6] = {"月缺月圆便常圆；"},
			[7] = {"只要心心相印，"},
			[8] = {"山远水远不算远；"},
			[9] = {"只要相敬如宾，"},
			[10] = {"千难万难不觉难。"},
			[11] = {"罗贵妃，你能理解我吗？"},
		},
	},
	[2] = 
	{
		[3506] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3542] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3579] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3585] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3554] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3530] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3536] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3548] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3560] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3590] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3595] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3512] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3518] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3524] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
	},
	[3] = 
	{
		[2425] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[4184] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[2426] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3316] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[4665] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[2422] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[2423] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[2424] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[4002] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3244] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3227] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3228] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3301] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3245] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3247] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3250] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3320] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
	},
	[4] = 
	{
		[3561] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3562] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3563] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3564] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3565] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3566] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3567] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3568] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3569] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3576] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3601] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3603] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[4041] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[4042] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[2607] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[2608] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[2606] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
	},
	[5] = 
	{
		[80] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[81] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3590] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3591] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[76] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3234] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3237] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[4237] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3230] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[3655] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[41] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[161] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[193] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[199] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[228] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
		[245] = 
		{
			[1] = {"从前有座山。"},
			[2] = {"山上有座庙。"},
			[3] = {"庙里有个老和尚"},
			[4] = {"还有个小和尚"},
			[5] = {"老和尚正在给小和尚讲故事"},
			[6] = {"讲的什么呢？"},
			[7] = {"下一个NPC告诉你"},
		},
	}
};

