-- 文件名　：horse_box_base.lua
-- 创建者　：jiazhenwei
-- 创建时间：2012-02-09 15:00:19
-- 功能    ：财宝兔箱子
  
local tbItem = Item:GetClass("patbox");

tbItem.tbPat = {
	[1] = {{ "财宝兔（30天）（获取绑定）", {18,1,1724,1}, 1, 1, 30 * 3600 * 24 }},
	[2] = {
		{ "葫小芦（红）", {18,1,1730,2}, 1, 1, 30 * 3600 * 24 },
		{ "葫小芦（橙）", {18,1,1730,3}, 1, 1, 30 * 3600 * 24 },
		{ "葫小芦（黄）", {18,1,1730,4}, 1, 1, 30 * 3600 * 24 },
		{ "葫小芦（绿）", {18,1,1730,5}, 1, 1, 30 * 3600 * 24 },
		{ "葫小芦（青）", {18,1,1730,6}, 1, 1, 30 * 3600 * 24 },
		{ "葫小芦（蓝）", {18,1,1730,7}, 1, 1, 30 * 3600 * 24 },
		{ "葫小芦（紫）", {18,1,1730,8}, 1, 1, 30 * 3600 * 24 },
		},
	[3] = {{ "财宝兔（7天）（获取绑定）", {18,1,1724,1}, 1, 1, 7 * 3600 * 24 }},
	[4] = {
		{ "葫小芦（红）", {18,1,1730,2}, 1, 1, 10 * 3600 * 24 },
		{ "葫小芦（橙）", {18,1,1730,3}, 1, 1, 10 * 3600 * 24 },
		{ "葫小芦（黄）", {18,1,1730,4}, 1, 1, 10 * 3600 * 24 },
		{ "葫小芦（绿）", {18,1,1730,5}, 1, 1, 10 * 3600 * 24 },
		{ "葫小芦（青）", {18,1,1730,6}, 1, 1, 10 * 3600 * 24 },
		{ "葫小芦（蓝）", {18,1,1730,7}, 1, 1, 10 * 3600 * 24 },
		{ "葫小芦（紫）", {18,1,1730,8}, 1, 1, 10 * 3600 * 24 },
		},
	[5] = {
		{ "玫瑰精灵", {18,1,1751,8}, 1, 1, 7 * 3600 * 24 },
		},
	[6] = {
		{ "葫小芦（红）", {18,1,1730,2}, 1, 1, 15 * 3600 * 24 },
		{ "葫小芦（橙）", {18,1,1730,3}, 1, 1, 15 * 3600 * 24 },
		{ "葫小芦（黄）", {18,1,1730,4}, 1, 1, 15 * 3600 * 24 },
		{ "葫小芦（绿）", {18,1,1730,5}, 1, 1, 15 * 3600 * 24 },
		{ "葫小芦（青）", {18,1,1730,6}, 1, 1, 15 * 3600 * 24 },
		{ "葫小芦（蓝）", {18,1,1730,7}, 1, 1, 15 * 3600 * 24 },
		{ "葫小芦（紫）", {18,1,1730,8}, 1, 1, 15 * 3600 * 24 },
		},
	[7] = {
		{ "葫小芦（红）", {18,1,1730,2}, 1, 1, 7 * 3600 * 24 },
		{ "葫小芦（橙）", {18,1,1730,3}, 1, 1, 7 * 3600 * 24 },
		{ "葫小芦（黄）", {18,1,1730,4}, 1, 1, 7 * 3600 * 24 },
		{ "葫小芦（绿）", {18,1,1730,5}, 1, 1, 7 * 3600 * 24 },
		{ "葫小芦（青）", {18,1,1730,6}, 1, 1, 7 * 3600 * 24 },
		{ "葫小芦（蓝）", {18,1,1730,7}, 1, 1, 7 * 3600 * 24 },
		{ "葫小芦（紫）", {18,1,1730,8}, 1, 1, 7 * 3600 * 24 },
		},
	[8] = {
		{ "葫小芦（红）", {18,1,1730,2}, 1, 1, 3 * 3600 * 24 },
		{ "葫小芦（橙）", {18,1,1730,3}, 1, 1, 3 * 3600 * 24 },
		{ "葫小芦（黄）", {18,1,1730,4}, 1, 1, 3 * 3600 * 24 },
		{ "葫小芦（绿）", {18,1,1730,5}, 1, 1, 3 * 3600 * 24 },
		{ "葫小芦（青）", {18,1,1730,6}, 1, 1, 3 * 3600 * 24 },
		{ "葫小芦（蓝）", {18,1,1730,7}, 1, 1, 3 * 3600 * 24 },
		{ "葫小芦（紫）", {18,1,1730,8}, 1, 1, 3 * 3600 * 24 },
		},
};

function tbItem:OnUse()
	local nIndex = tonumber(it.GetExtParam(1));
	local szInfo = string.format("一个专门收藏召唤宠的神秘宝箱，江湖中人人向往。请选择你想要的宠物(只能选择一个喔~)：");
	local tbOpt ={};
	for i, tbInfo in pairs(self.tbPat[nIndex]) do
		tbOpt[#tbOpt + 1] = {string.format("<color=yellow>%s<color>", tbInfo[1]), self.AddPat, self, it.dwId, i, nIndex};
	end
	
	tbOpt[#tbOpt + 1] = {"Để ta suy nghĩ lại"};
	
	Dialog:Say(szInfo,tbOpt);
	return 0;
end

function tbItem:AddPat(nItemId, nIndex, nBaseIndex, nFlag)
	local tbInfo = self.tbPat[nBaseIndex][nIndex];
	if (not tbInfo) then
		Dialog:Say("宠物宝箱出问题了！");
		return 0;
	end
	if me.CountFreeBagCell() < tbInfo[4] then
		Dialog:Say(string.format("请留出<color=green>%s格<color>背包空间。", tbInfo[4]));
		return 0;
	end
	
	if (not nFlag or nFlag ~= 1) then
		Dialog:Say(string.format("你确定领取<color=yellow>%s<color>吗？", tbInfo[1]), 
			{
				{"Xác nhận", self.AddPat, self, nItemId, nIndex, nBaseIndex, 1},
				{"Để ta suy nghĩ lại"},
			});
		return 0;
	end

	local pItem =  KItem.GetObjById(nItemId);
	if pItem then
		pItem.Delete(me);
		local pItemEx = me.AddItem(unpack(tbInfo[2]));
		if (tbInfo[3] == 1) then
			pItemEx.Bind(1);
		end
		if (pItemEx) then
			pItemEx.SetTimeOut(0, GetTime() + tbInfo[5]);
			pItemEx.Sync();
		end
	end
end
	
