--武林世家腰牌的一些参数及奖励设置
--zounan1@kingsoft.com
--2009-09-17 17:16

local tbItem = Item:GetClass("shijiayaopai");  

tbItem.QIANGHUALEVEL_WEAPON  = 8;     --武器强化+8
tbItem.QIANGHUALEVEL_EQUIP  = 8;	  --装备强化+8
tbItem.FUDAI_COUNT   = 2;              --领取福袋的数目

tbItem.TASK_GROUP_ID = 2027;
tbItem.TASK_DATE_XIULIAN = 82;
tbItem.TASK_DATE_FUDAI   = 83;
tbItem.TASK_WEAPON     = 84;     
tbItem.TASK_FANGJU_NUM =  85;   
tbItem.TASK_FANGJU_SEL =  86;    -- 总共可以选两次故 要记录第一次选择的ID，使得第二次不能选同样的装备
tbItem.TASK_SHOUSHI_NUM = 87;
tbItem.TASK_SHOUSHI_SEL = 88;	 -- 总共可以选两次故 要记录第一次选择的ID，使得第二次不能选同样的装备

--武器道具ID 格式   tbWeapon[nFaction][nRouteId]
tbItem.tbWeapon = {
	 [1] ={
	 	{2,1,546,5},                      -- 月牙刀	橙装PVE_刀少月牙刀	2	1	546	5		武器
	 	{2,1,556,5},                       -- 分水棍	橙装PVE_棍少分水棍	2	1	556	5	  
	 	} ,		-- 少林
	 [2] = {
	 	{2,1,566,5},                      --金钩枪	橙装PVE_枪天金钩枪	2	1	566	5	
	 	{2,1,576,5},                       --霹雳锤	橙装PVE_锤天霹雳锤	2	1	576	5	
	 	},		-- 天王
     [3] = {
     	{2,2,65,5},	                      --定军刀	橙装PVE_刀唐定军刀	2	2	65	5		
		{2,2,75,5},						  --连珠箭	橙装PVE_弩唐连珠箭	2	2	75	5	    	
     	},		-- 唐门
     [4] = {                               
     	{2,1,586,5},					  --月牙刀	橙装PVE_刀毒月牙刀	2	1	586	5		
		{2,1,596,5}, 					  --穿云缠手	橙装PVE_掌毒穿云缠手	2	1	596	5  	
     	},		-- 五毒
     [5] = {
    	{2,1,626,5},                      --穿云缠手	橙装PVE_掌峨穿云缠手	2	1	626	5
    	{2,1,636,5},                      --龙泉剑	橙装PVE_剑翠、气段、辅峨龙泉剑	2	1	636	5	
    	},		-- 峨嵋
     [6] = {
     	{2,1,636,5},                      --龙泉剑	橙装PVE_剑翠、气段、辅峨龙泉剑	2	1	636	5
    	{2,1,606,5},                 	  --月牙刀	橙装PVE_刀翠月牙刀	2	1	606	5	
        },		-- 翠烟
     [7] = {
     	{2,1,666,5},                      --穿云缠手	橙装PVE_掌丐穿云缠手	2	1	666	5
    	{2,1,646,5},                 	  --分水棍	橙装PVE_棍丐分水棍	2	1	646	5	
        },		-- 丐帮
     [8] = {
     	{2,1,656,5},                      --金钩枪	橙装PVE_战忍金钩枪	2	1	656	5
    	{2,1,676,5},                 	  --月牙刀	橙装PVE_魔忍月牙刀	2	1	676	5	
        },		-- 天忍
     [9] = {
     	{2,1,706,5},                      --龙泉剑	橙装PVE_气武龙泉剑	2	1	706	5		
    	{2,1,696,5},                 	  --龙泉剑	橙装PVE_剑武龙泉剑	2	1	696	5	
        },		-- 武当
     [10] = {
     	{2,1,686,5},                      --月牙刀	橙装PVE_刀昆月牙刀	2	1	686	5	
    	{2,1,716,5},                 	  --龙泉剑	橙装PVE_剑昆龙泉剑	2	1	716	5
        },		-- 昆仑
     [11] = {
     	{2,1,966,5},                      --霹雳锤	橙装PVE_锤明教霹雳锤	2	1	966	5	
    	{2,1,976,5},                 	  --龙泉剑	橙装PVE_剑明教龙泉剑	2	1	976	5		
        },		-- 明教   
     [12] = {
     	{2,1,616,5},                      --穿云缠手	橙装PVE_指段穿云缠手	2	1	616	5	
    	{2,1,636,5},                 	  --龙泉剑	橙装PVE_剑翠、气段、辅峨龙泉剑	2	1	636	5		
        },		-- 段氏        
	};

--按门派分格式   tbYifu[nFaction][nSex][nFaction]
tbItem.tbYifu = {
	 [1] ={
	 	[0] = {
	 		{2,3,629,7},                      -- 天梦装	橙装PVE_刀少天梦装	2	3	629	7	男	
	 		{2,3,609,7},                      -- 山文字甲	橙装PVE_棍少、天王山文字甲	2	3	609	7	男		  
	 		},
	 	[1] = {
	 		{2,3,639,7},                      -- 黑貂裘	橙装PVE_刀少黑貂裘	2	3	639	7	女	
	 		{2,3,619,7},                      -- 红茸甲	橙装PVE_棍少、天王红茸甲	2	3	619	7	女		 		
	 		},	
	 	} ,		-- 少林 刀棍
	 [2] = {
	 	[0] = {
	 		{2,3,609,7},                      -- 山文字甲	橙装PVE_棍少、天王山文字甲	2	3	609	7	男
	 		{2,3,609,7},                      -- 山文字甲	橙装PVE_棍少、天王山文字甲	2	3	609	7	男		  
	 		},
	 	[1] = {
	 		{2,3,619,7},                      -- 红茸甲	橙装PVE_棍少、天王红茸甲	2	3	619	7	女
	 		{2,3,619,7},                      -- 红茸甲	橙装PVE_棍少、天王红茸甲	2	3	619	7	女		 		
	 		},	
	 	},		-- 天王 枪锤
     [3] = {
 	 	[0] = {
	 		{2,3,649,7},                      -- 天梦装	橙装PVE_刀毒、唐门、明教天梦装	2	3	649	7	男	
	 		{2,3,649,7},                      -- 天梦装	橙装PVE_刀毒、唐门、明教天梦装	2	3	649	7	男			  
	 		},
	 	[1] = {
	 		{2,3,659,7},                      -- 黑貂裘	橙装PVE_刀毒、唐门、明教黑貂裘	2	3	659	7	女
	 		{2,3,659,7},                      -- 黑貂裘	橙装PVE_刀毒、唐门、明教黑貂裘	2	3	659	7	女		 		
	 		},	    	
     	},		-- 唐门 飞刀 袖箭
     [4] = {                               
 	 	[0] = {
	 		{2,3,649,7},                      -- 天梦装	橙装PVE_刀毒、唐门、明教天梦装	2	3	649	7	男		
	 		{2,3,669,7},                      -- 相如袍	橙装PVE_掌毒相如袍	2	3	669	7	男	
	 		},
	 	[1] = {
	 		{2,3,659,7},                      -- 黑貂裘	橙装PVE_刀毒、唐门、明教黑貂裘	2	3	659	7	女
	 		{2,3,679,7},                      -- 琼玉衫	橙装PVE_掌毒琼玉衫	2	3	679	7	女		 		
	 		},		
     	},		-- 五毒 刀掌
     [5] = {
 	 	[0] = {
	 		{2,3,709,7},                      -- 相如袍	橙装PVE_峨嵋、翠烟、气段相如袍	2	3	709	7	男	
	 		{2,3,709,7},                      -- 相如袍	橙装PVE_峨嵋、翠烟、气段相如袍	2	3	709	7	男		  
	 		},
	 	[1] = {
	 		{2,3,719,7},                      -- 琼玉衫	橙装PVE_峨嵋、翠烟、气段琼玉衫	2	3	719	7	女
	 		{2,3,719,7},                      -- 琼玉衫	橙装PVE_峨嵋、翠烟、气段琼玉衫	2	3	719	7	女		 		
	 		},	
    	},		-- 峨嵋 掌 辅助
     [6] = {
   	 	[0] = {
	 		{2,3,709,7},                      -- 相如袍	橙装PVE_峨嵋、翠烟、气段相如袍	2	3	709	7	男	
	 		{2,3,709,7},                      -- 相如袍	橙装PVE_峨嵋、翠烟、气段相如袍	2	3	709	7	男			  
	 		},
	 	[1] = {
	 		{2,3,719,7},                      -- 琼玉衫	橙装PVE_峨嵋、翠烟、气段琼玉衫	2	3	719	7	女
	 		{2,3,719,7},                      -- 琼玉衫	橙装PVE_峨嵋、翠烟、气段琼玉衫	2	3	719	7	女		 		
	 		},	
        },		-- 翠烟  剑 刀
     [7] = {
   	 	[0] = {
	 		{2,3,749,7},                      -- 天梦装	橙装PVE_魔忍、丐帮天梦装	2	3	749	7	男
	 		{2,3,749,7},                      -- 天梦装	橙装PVE_魔忍、丐帮天梦装	2	3	749	7	男	  
	 		},
	 	[1] = {
	 		{2,3,759,7},                      -- 黑貂裘	橙装PVE_魔忍、丐帮黑貂裘	2	3	759	7	女
	 		{2,3,759,7},                      -- 黑貂裘	橙装PVE_魔忍、丐帮黑貂裘	2	3	759	7	女	 		
	 		},	
        },		-- 丐帮  掌棍
     [8] = {
		[0] = {
	 		{2,3,729,7},                      -- 山文字甲	橙装PVE_战忍山文字甲	2	3	729	7	男
	 		{2,3,749,7},                      -- 天梦装	橙装PVE_魔忍、丐帮天梦装	2	3	749	7	男	  
	 		},
	 	[1] = {
	 		{2,3,739,7},                      -- 红茸甲	橙装PVE_战忍红茸甲	2	3	739	7	女	
	 		{2,3,759,7},                      -- 黑貂裘	橙装PVE_魔忍、丐帮黑貂裘	2	3	759	7	女		 		
	 		},	
        },		-- 天忍  战 魔
     [9] = {
    	[0] = {
	 		{2,3,789,7},                      -- 相如袍	橙装PVE_气武、昆仑相如袍	2	3	789	7	男
	 		{2,3,769,7},                      -- 山文字甲	橙装PVE_剑武山文字甲	2	3	769	7	男 
	 		},
	 	[1] = {
	 		{2,3,799,7},                      -- 琼玉衫	橙装PVE_气武、昆仑琼玉衫	2	3	799	7	女
	 		{2,3,779,7},                      -- 红茸甲	橙装PVE_剑武红茸甲	2	3	779	7	女		 		
	 		},	
        },		-- 武当 气 剑
     [10] = {
 	 	[0] = {
	 		{2,3,789,7},                      -- 相如袍	橙装PVE_气武、昆仑相如袍	2	3	789	7	男
	 		{2,3,789,7},                      -- 相如袍	橙装PVE_气武、昆仑相如袍	2	3	789	7	男
	 		},
	 	[1] = {
	 		{2,3,799,7},                      -- 琼玉衫	橙装PVE_气武、昆仑琼玉衫	2	3	799	7	女
	 		{2,3,799,7},                      -- 琼玉衫	橙装PVE_气武、昆仑琼玉衫	2	3	799	7	女	 		
	 		},	
        },		-- 昆仑 刀 剑
     [11] = {
	 	[0] = {
	 		{2,3,649,7},                      -- 天梦装	橙装PVE_刀毒、唐门、明教天梦装	2	3	649	7	男	
	 		{2,3,649,7},                      -- 天梦装	橙装PVE_刀毒、唐门、明教天梦装	2	3	649	7	男	  
	 		},
	 	[1] = {
	 		{2,3,659,7},                      -- 黑貂裘	橙装PVE_刀毒、唐门、明教黑貂裘	2	3	659	7	女
	 		{2,3,659,7},                      -- 黑貂裘	橙装PVE_刀毒、唐门、明教黑貂裘	2	3	659	7	女		 		
	 		},		
        },		-- 明教   锤 剑
     [12] = {
 	 	[0] = {
	 		{2,3,689,7},                      -- 山文字甲	橙装PVE_指段山文字甲	2	3	689	7	男	
	 		{2,3,709,7},                      -- 相如袍	橙装PVE_峨嵋、翠烟、气段相如袍	2	3	709	7	男		  
	 		},
	 	[1] = {
	 		{2,3,699,7},                      -- 红茸甲	橙装PVE_指段红茸甲	2	3	699	7	女
	 		{2,3,719,7},                      -- 琼玉衫	橙装PVE_峨嵋、翠烟、气段琼玉衫	2	3	719	7	女		 		
	 		},		
        },		-- 段氏   指 气   
	};
	
tbItem.tbMaozi = {
	 [1] ={
	 	[0] = {
	 		{2,9,627,7},                      -- 青煞发冠	橙装PVE_刀少青煞发冠	2	9	627	7	男
	 		{2,9,607,7},                      -- 异神盔	橙装PVE_棍少、天王异神盔	2	9	607	7	男		  
	 		},
	 	[1] = {
	 		{2,9,637,7},                      -- 赤豚面罩	橙装PVE_刀少赤豚面罩	2	9	637	7	女
	 		{2,9,617,7},                      -- 龙鳞盔	橙装PVE_棍少、天王龙鳞盔	2	9	617	7	女		 		
	 		},	
	 	} ,		-- 少林 刀棍
	 [2] = {
	 	[0] = {
	 		{2,9,607,7},                      -- 异神盔	橙装PVE_棍少、天王异神盔	2	9	607	7	男
	 		{2,9,607,7},                      -- 异神盔	橙装PVE_棍少、天王异神盔	2	9	607	7	男	  
	 		},
	 	[1] = {
	 		{2,9,617,7},                      -- 龙鳞盔	橙装PVE_棍少、天王龙鳞盔	2	9	617	7	女
	 		{2,9,617,7},                      -- 龙鳞盔	橙装PVE_棍少、天王龙鳞盔	2	9	617	7	女	 		
	 		},	
	 	},		-- 天王 枪锤
     [3] = {
 	 	[0] = {
	 		{2,9,647,7},                      -- 青煞发冠	橙装PVE_刀毒、唐门、明教青煞发冠	2	9	647	7	男	
	 		{2,9,647,7},                      -- 青煞发冠	橙装PVE_刀毒、唐门、明教青煞发冠	2	9	647	7	男		  
	 		},
	 	[1] = {
	 		{2,9,657,7},                      -- 赤豚面罩	橙装PVE_刀毒、唐门、明教赤豚面罩	2	9	657	7	女	
	 		{2,9,657,7},                      -- 赤豚面罩	橙装PVE_刀毒、唐门、明教赤豚面罩	2	9	657	7	女		 		
	 		},	    	
     	},		-- 唐门 飞刀 袖箭
     [4] = {                               
 	 	[0] = {
	 		{2,9,647,7},                      -- 青煞发冠	橙装PVE_刀毒、唐门、明教青煞发冠	2	9	647	7	男		
	 		{2,9,667,7},                      -- 绝玉束额	橙装PVE_掌毒绝玉束额	2	9	667	7	男	
	 		},
	 	[1] = {
	 		{2,9,657,7},                      -- 赤豚面罩	橙装PVE_刀毒、唐门、明教赤豚面罩	2	9	657	7	女	
	 		{2,9,677,7},                      -- 朱雀发结	橙装PVE_掌毒朱雀发结	2	9	677	7	女		 		
	 		},		
     	},		-- 五毒 刀掌
     [5] = {
 	 	[0] = {
	 		{2,9,707,7},                      -- 绝玉束额	橙装PVE_气段、翠烟、峨嵋绝玉束额	2	9	707	7	男	
	 		{2,9,707,7},                      -- 绝玉束额	橙装PVE_气段、翠烟、峨嵋绝玉束额	2	9	707	7	男		  
	 		},
	 	[1] = {
	 		{2,9,717,7},                      -- 朱雀发结	橙装PVE_气段、翠烟、峨嵋朱雀发结	2	9	717	7	女
	 		{2,9,717,7},                      -- 朱雀发结	橙装PVE_气段、翠烟、峨嵋朱雀发结	2	9	717	7	女		 		
	 		},	
    	},		-- 峨嵋 掌 辅助
     [6] = {
   	 	[0] = {
	 		{2,9,707,7},                      -- 绝玉束额	橙装PVE_气段、翠烟、峨嵋绝玉束额	2	9	707	7	男	
	 		{2,9,707,7},                      -- 绝玉束额	橙装PVE_气段、翠烟、峨嵋绝玉束额	2	9	707	7	男			  
	 		},
	 	[1] = {
	 		{2,9,717,7},                      -- 朱雀发结	橙装PVE_气段、翠烟、峨嵋朱雀发结	2	9	717	7	女
	 		{2,9,717,7},                      -- 朱雀发结	橙装PVE_气段、翠烟、峨嵋朱雀发结	2	9	717	7	女		 		
	 		},	
        },		-- 翠烟  剑 刀
     [7] = {
   	 	[0] = {
	 		{2,9,747,7},                      -- 青煞发冠	橙装PVE_魔忍、丐帮青煞发冠	2	9	747	7	男
	 		{2,9,747,7},                      -- 青煞发冠	橙装PVE_魔忍、丐帮青煞发冠	2	9	747	7	男	  
	 		},
	 	[1] = {
	 		{2,9,757,7},                      -- 赤豚面罩	橙装PVE_魔忍、丐帮赤豚面罩	2	9	757	7	女
	 		{2,9,757,7},                      -- 赤豚面罩	橙装PVE_魔忍、丐帮赤豚面罩	2	9	757	7	女	 		
	 		},	
        },		-- 丐帮  掌棍
     [8] = {
		[0] = {
	 		{2,9,727,7},                      -- 异神盔	橙装PVE_战忍异神盔	2	9	727	7	男
	 		{2,9,747,7},                      -- 青煞发冠	橙装PVE_魔忍、丐帮青煞发冠	2	9	747	7	男	  
	 		},
	 	[1] = {
	 		{2,9,737,7},                      -- 龙鳞盔	橙装PVE_战忍龙鳞盔	2	9	737	7	女	
	 		{2,9,757,7},                      -- 赤豚面罩	橙装PVE_魔忍、丐帮赤豚面罩	2	9	757	7	女		 		
	 		},	
        },		-- 天忍  战 魔
     [9] = {
    	[0] = {
	 		{2,9,787,7},                      -- 绝玉束额	橙装PVE_气武、昆仑绝玉束额	2	9	787	7	男
	 		{2,9,767,7},                      -- 异神盔	橙装PVE_剑武异神盔	2	9	767	7	男	 
	 		},
	 	[1] = {
	 		{2,9,797,7},                      -- 朱雀发结	橙装PVE_气武、昆仑朱雀发结	2	9	797	7	女
	 		{2,9,777,7},                      -- 龙鳞盔	橙装PVE_剑武龙鳞盔	2	9	777	7	女		 		
	 		},	
        },		-- 武当 气 剑
     [10] = {
 	 	[0] = {
	 		{2,9,787,7},                      -- 绝玉束额	橙装PVE_气武、昆仑绝玉束额	2	9	787	7	男
	 		{2,9,787,7},                      -- 绝玉束额	橙装PVE_气武、昆仑绝玉束额	2	9	787	7	男
	 		},
	 	[1] = {
	 		{2,9,797,7},                      -- 朱雀发结	橙装PVE_气武、昆仑朱雀发结	2	9	797	7	女
	 		{2,9,797,7},                      -- 朱雀发结	橙装PVE_气武、昆仑朱雀发结	2	9	797	7	女	 		
	 		},	
        },		-- 昆仑 刀 剑
     [11] = {
	 	[0] = {
	 		{2,9,647,7},                      -- 青煞发冠	橙装PVE_刀毒、唐门、明教青煞发冠	2	9	647	7	男	
	 		{2,9,647,7},                      -- 青煞发冠	橙装PVE_刀毒、唐门、明教青煞发冠	2	9	647	7	男	  
	 		},
	 	[1] = {
	 		{2,9,657,7},                      -- 赤豚面罩	橙装PVE_刀毒、唐门、明教赤豚面罩	2	9	657	7	女	
	 		{2,9,657,7},                      -- 赤豚面罩	橙装PVE_刀毒、唐门、明教赤豚面罩	2	9	657	7	女		 		
	 		},		
        },		-- 明教   锤 剑
     [12] = {
 	 	[0] = {
	 		{2,9,687,7},                      -- 异神盔	橙装PVE_指段异神盔	2	9	687	7	男		
	 		{2,9,707,7},                      -- 绝玉束额	橙装PVE_气段、翠烟、峨嵋绝玉束额	2	9	707	7	男		  
	 		},
	 	[1] = {
	 		{2,9,697,7},                      -- 龙鳞盔	橙装PVE_指段龙鳞盔	2	9	697	7	女
	 		{2,9,717,7},                      -- 朱雀发结	橙装PVE_气段、翠烟、峨嵋朱雀发结	2	9	717	7	女		 		
	 		},		
        },		-- 段氏   指 气   
	};	
	
--按五行分  格式   tbYaodai[nSeries][nSex]
tbItem.tbYaodai = {
	 [1] ={
	 	[0] = {2,8,307,7},                    
	 	[1] = {2,8,317,7},                    			
	 	} ,		-- 金
	 [2] ={
	 	[0] = {2,8,327,7},                   
	 	[1] = {2,8,337,7},                  	
	 	} ,		-- 木
	 [3] ={
	 	[0] = {2,8,347,7},                 
	 	[1] = {2,8,357,7},                		
	 	} ,		-- 水
	 [4] ={
	 	[0] = {2,8,367,7},                 
	 	[1] = {2,8,377,7},                		
	 	} ,		-- 火
	 [5] ={
	 	[0] = {2,8,387,7},                   
	 	[1] = {2,8,397,7},                  
	 	} ,		-- 土
	};
			
tbItem.tbXiezi = {
	 [1] ={
	 	[0] = {2,7,309,7},                    
	 	[1] = {2,7,319,7},                    			
	 	} ,		-- 金
	 [2] ={
	 	[0] = {2,7,329,7},                   
	 	[1] = {2,7,339,7},                  	
	 	} ,		-- 木
	 [3] ={
	 	[0] = {2,7,349,7},                 
	 	[1] = {2,7,359,7},                		
	 	} ,		-- 水
	 [4] ={
	 	[0] = {2,7,369,7},                 
	 	[1] = {2,7,379,7},                		
	 	} ,		-- 火
	 [5] ={
	 	[0] = {2,7,389,7},                   
	 	[1] = {2,7,399,7},                  
	 	} ,		-- 土
	};
		
tbItem.tbHuwan = {
	 [1] ={
	 	[0] = {2,10,309,7},                    
	 	[1] = {2,10,319,7},                    			
	 	} ,		-- 金
	 [2] ={
	 	[0] = {2,10,329,7},                   
	 	[1] = {2,10,339,7},                  	
	 	} ,		-- 木
	 [3] ={
	 	[0] = {2,10,349,7},                 
	 	[1] = {2,10,359,7},                		
	 	} ,		-- 水
	 [4] ={
	 	[0] = {2,10,369,7},                 
	 	[1] = {2,10,379,7},                		
	 	} ,		-- 火
	 [5] ={
	 	[0] = {2,10,389,7},                   
	 	[1] = {2,10,399,7},                  
	 	} ,		-- 土
	};
	
tbItem.tbYaozhui = {
	 [1] ={
	 	[0] = {2,11,307,7},                    
	 	[1] = {2,11,317,7},                    			
	 	} ,		-- 金
	 [2] ={
	 	[0] = {2,11,327,7},                   
	 	[1] = {2,11,337,7},                  	
	 	} ,		-- 木
	 [3] ={
	 	[0] = {2,11,347,7},                 
	 	[1] = {2,11,357,7},                		
	 	} ,		-- 水
	 [4] ={
	 	[0] = {2,11,367,7},                 
	 	[1] = {2,11,377,7},                		
	 	} ,		-- 火
	 [5] ={
	 	[0] = {2,11,387,7},                   
	 	[1] = {2,11,397,7},                  
	 	} ,		-- 土
	};
	
tbItem.tbHushenfu = {
	 [1] ={
	 	[0] = {2,6,158,7},                    
	 	[1] = {2,6,158,7},                    			
	 	} ,		-- 金
	 [2] ={
	 	[0] = {2,6,168,7},                   
	 	[1] = {2,6,168,7},                  	
	 	} ,		-- 木
	 [3] ={
	 	[0] = {2,6,178,7},                 
	 	[1] = {2,6,178,7},                		
	 	} ,		-- 水
	 [4] ={
	 	[0] = {2,6,188,7},                 
	 	[1] = {2,6,188,7},                		
	 	} ,		-- 火
	 [5] ={
	 	[0] = {2,6,198,7},                   
	 	[1] = {2,6,198,7},                  
	 	} ,		-- 土
	};
	
tbItem.tbXianglian = {
	 [1] ={
	 	[0] = {2,5,157,7},                    
	 	[1] = {2,5,157,7},                    			
	 	} ,		-- 金
	 [2] ={
	 	[0] = {2,5,167,7},                   
	 	[1] = {2,5,167,7},                  	
	 	} ,		-- 木
	 [3] ={
	 	[0] = {2,5,177,7},                 
	 	[1] = {2,5,177,7},                		
	 	} ,		-- 水
	 [4] ={
	 	[0] = {2,5,187,7},                 
	 	[1] = {2,5,187,7},                		
	 	} ,		-- 火
	 [5] ={
	 	[0] = {2,5,197,7},                   
	 	[1] = {2,5,197,7},                  
	 	} ,		-- 土
	};
	
tbItem.tbJiezhi = {
	 [1] ={
	 	[0] = {2,4,157,7},                    
	 	[1] = {2,4,157,7},                    			
	 	} ,		-- 金
	 [2] ={
	 	[0] = {2,4,167,7},                   
	 	[1] = {2,4,167,7},                  	
	 	} ,		-- 木
	 [3] ={
	 	[0] = {2,4,177,7},                 
	 	[1] = {2,4,177,7},                		
	 	} ,		-- 水
	 [4] ={
	 	[0] = {2,4,187,7},                 
	 	[1] = {2,4,187,7},                		
	 	} ,		-- 火
	 [5] ={
	 	[0] = {2,4,197,7},                   
	 	[1] = {2,4,197,7},                  
	 	} ,		-- 土
	};
	
--防具集合	
tbItem.tbFangju = {
	[1] = tbItem.tbYifu,
	[2] = tbItem.tbMaozi,
	[3] = tbItem.tbYaodai,
	[4] = tbItem.tbXiezi,
	[5] = tbItem.tbHuwan,
	};	
	
--首饰集合
tbItem.tbShoushi = {
	[1] = tbItem.tbHushenfu,
	[2] = tbItem.tbJiezhi,
	[3] = tbItem.tbYaozhui,
	[4] = tbItem.tbXianglian,
	};
	
--装备集合
tbItem.tbEquip = {
	[1] = tbItem.tbFangju,
	[2] = tbItem.tbShoushi,
	};	
	
--关于装备任务变量的集合
tbItem.tbTask = {
    [1] = {
    	[1] = tbItem.TASK_FANGJU_NUM, 
	 	[2] = tbItem.TASK_FANGJU_SEL,
	 	},
    [2] = {
    	[1] = tbItem.TASK_SHOUSHI_NUM,
		[2] = tbItem.TASK_SHOUSHI_SEL,
		},
	};	
