-------------------------------------------------------------------
--File		: kingame_def.lua
--Author	: zhengyuhua
--Date		: 2008-5-13 10:24
--Describe	: 家族关卡定义脚本
-------------------------------------------------------------------

local preEnv = _G	--保存旧的环境
setfenv(1, KinGame)	--设置当前环境为Kin

MAX_WEEK_DEGREE	= 2;		-- 周最大次数

FIX_NPC = 1;
DIF_NPC = 2;
COPY_NPC = 3;

-- 副本地图模板ID
MAP_TEMPLATE_ID = 273

GAME_MAX_TIME			= 2 * 3600 * 18 
MAX_GAME 				= 30;		-- 一个城市的最大副本数
MIN_PLAYER				= 6;		-- 参加副本的最小人数
TASK_GROUP_ID 			= 2028;		-- 斗场任务变量groupid
TASK_BAG_ID 			= 1; 		-- 钱袋任务变量
TASK_USED_NUM			= 2;
TASK_WEEK_ID			= 3;
TASK_NOW_WEEK_TIME		= 4;		-- 记录今天参加时间
MAX_MIYAO_LIMIT_ITEM 	= 3; 		-- 每个迷药刷出最大个数 
MAX_BAOXIANG 			= 5; 		-- 每个房间刷的最大古铜币宝箱数
NPCID_BAOXIANG 			= 2960; 	-- 古铜币宝箱Id
MAX_GUQIANBI			= 1000;		-- 最大古钱币存储量
KIN_REPUTE_CAMP			= 4;
KIN_REPUTE_CALSS		= 1;
KEY_ITME_TIME			= 10;
PAY_GUQIANBI			= 5;		--返回选择间所需要古钱币

GOU_HUN_YU_COST			= {50, 150, 300}; 	-- 换取勾魂玉的古银币数

GOU_HUN_YU_ITEM			= {18,1,146}		-- 勾魂玉道具
OPEN_KEY_ITEM = {18, 1, 106, 1, {bForceBind = 1, bTimeOut = 1}} 	-- 钥匙道具
QIANDAI_ITEM = {18, 1, 98, 1}		-- 钱袋道具
ZHENCHANGBAOXIANG_ITEM = {18, 1, 109, 1}		-- 马穿山的珍藏宝箱

FIGHTSTATE_POS = {1642,3191}	--入口状态状态转换传入点

ENTER_POS = 
{
	{51552 / 32,	102592 / 32},
	{51680 / 32,	102720 / 32},
	{51552 / 32,	102944 / 32},
	{51392 / 32,	102752 / 32},
	{51648 / 32,	103072 / 32},
	{51808 / 32,	102880 / 32},
}
LEAVE_POS =
{	
	[26] = {1514, 3123},
	[25] = {1726, 3245},
	[29] = {1718, 4090},
	[24] = {1954, 3571},
	[28] = {1602, 3359},
	[27] = {1666, 3260},
	[23] = {1648, 3185},
}
DEATH_REV_POS_FIRST = {};

-- FIX_NPC, nTimeLock, nNumLock, nNpcIdx...
-- DIF_NPC, nTimeLock, nNumLock, nOnceNum, nDegree, nFrequency, nBoss

tbRoom = 
{
	[1] = 
	{
		{FIX_NPC, 10 * 60* 18, 1, 1, 2, 3},
	},
	[2] = 
	{
		{DIF_NPC, 2 * 60 * 18, 30, 15, 2, 60 * 18, 2},
	},
	[3] = 
	{
		{DIF_NPC, 0, 0, 24, 1, 0},
		{FIX_NPC, 0, 4, 1},
	},
	[4] = 				-- 反弹
	{
		{FIX_NPC, 0, 1, 1, 2},
		{DIF_NPC, 0, 30, 6, 5, 60 * 18},
	},
	[5] = 				-- 小BOSS
	{
		{FIX_NPC, 0, 0, 1},
		{DIF_NPC, 0, 1, 1, 1, 0},
	},
	[6] = 				-- 眩晕
	{
		{FIX_NPC, 0, 1, 1, 2},
		{DIF_NPC, 0, 30, 6, 5, 60 * 18},
	},
	[7] = 				-- 天
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[8] = 				-- 地
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[9] = 				-- 日
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},		
	[10] = 				-- 月
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[11] = 				-- 青龙
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[12] = 				-- 白虎
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[13] = 				-- 朱雀
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[14] = 				-- 玄武
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[15] = 				-- 密码1
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[16] = 				-- 密码2
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[17] = 				-- 密码3
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[18] = 				-- 密码4
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[19] = 				-- 密码5
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[20] = 				-- 密码6
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[21] = 				-- 密码7
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[22] = 				-- 密码8
	{
		{DIF_NPC, 0, 12, 12, 1, 0, 2},
		{FIX_NPC, 0, 1, 1},
	},
	[23] = 				-- 地雷
	{
		{FIX_NPC, 0, 1, 1},
		{DIF_NPC, 0, 25, 5, 5, 60 * 18},
	},
	[24] = 				-- 复制
	{
		{FIX_NPC, 0, 1, 1},
		{COPY_NPC},
	},
	[25] = 				-- 极速
	{
		{FIX_NPC, 0, 1, 1},
		{DIF_NPC, 0, 25, 5, 5, 60 * 18},
	},
	[26] = 				-- 休息
	{
		{FIX_NPC, 0, 0, 1},
	},
	[27] = 				-- 大BOSS
	{
		{FIX_NPC, 0, 0, 1},
		{DIF_NPC, 0, 1, 1, 1, 0},
	},
	[28] = 				-- 领奖
	{
		{FIX_NPC, 0, 0, 1, 2},
	},
	[29] = {},			-- 辅助用的房间
	[30] = {},			-- 辅助用的房间
}

ROOM_NAME =
{
	[1] = "入口",
	[2] = "小怪区",
	[3] = "选择间",
	[4] = "反弹铜人间",
	[5] = "小Boss区",
	[6] = "晕眩间",
	[7] = "天字间",
	[8] = "地字间",
	[9] = "日字间",
	[10] = "月字间",
	[11] = "青龙间",
	[12] = "白虎间",
	[13] = "朱雀间",
	[14] = "玄武间",
	[15] = "秘文间1",
	[16] = "秘文间2",
	[17] = "秘文间3",
	[18] = "秘文间4",
	[19] = "秘文间5",
	[20] = "秘文间6",
	[21] = "秘文间7",
	[22] = "秘文间8",
	[23] = "深渊",
	[24] = "复制间",
	[25] = "极速间",
	[26] = "休息间",
	[27] = "诅咒间",
	[28] = "宝箱间",
}

AWARD_TABLE = 
{
	--房间号 = 1古钱币，2声望，3房间开启公告，4房间解锁公告，5房间开启角色Ui同步信息，6房间解锁角色Ui同步信息
	[1] 	= { 0,	0,	"", "你听到背后入口“碰”的一声关掉了，看来只能向前走了。", "","关卡已开启"},
	[3] 	= {10, 	20, "", "伴随一阵轰隆声，房间内出现了3个石碑！", "现在需要解开选择间四角的机关", "现在需要解开反弹间、机关间、晕眩间内的机关"},
	[4]		= {10,	30, "", "你听到了“咔！”的一声脆响。","",""},
	[5]		= {10, 	30, "", "你听到了“咔！”的一声脆响。","",""},
	[6]		= {10,	30, "", "你听到了“咔！”的一声脆响。","",""},
	[15]	= {0,	0, 	"你发现房间旁边的门打开了！", "","现在需要解开秘文间1~8内的机关",""},
	[29]	= {20,	30, "", "你听到了“咔！”的一声脆响。","",""},
	[30]	= {20,	30, "", "你听到了“咔！”的一声脆响。","",""},
	[23]	= {10,	30,	"伴随着地板的震动，通往前方的门打开了！", "你听到了“咔！”的一声脆响。","现在需要解开深渊间、复制间、极速间内的机关",""},
	[24]	= {10,	30, "", "你听到了“咔！”的一声脆响。","",""},
	[25]	= {10,	30, "", "你听到了“咔！”的一声脆响。","",""},
	[26]	= {0,	0, 	"“轰！”的一声响，通往下个房间的通道打开了！", "","现在需要打倒诅咒间内的冥府冤魂",""};
	[27]	= {0,	40, "","一声巨响过后，通往出口的门打开了！","","关卡顺利通过"},
}

AWARD_TIMES=1;

preEnv.setfenv(1, preEnv)	--恢复全局环境


KinGame.REPUTE_SHOP_ID =
{
	[Env.FACTION_ID_SHAOLIN]	= 77, -- 少林
	[Env.FACTION_ID_TIANWANG]	= 78, --天王掌门
	[Env.FACTION_ID_TANGMEN]	= 79, --唐门掌门
	[Env.FACTION_ID_WUDU]		= 81, --五毒掌门
	[Env.FACTION_ID_EMEI]		= 83, --峨嵋掌门
	[Env.FACTION_ID_CUIYAN]		= 84, --翠烟掌门
	[Env.FACTION_ID_GAIBANG]	= 86, --丐帮掌门
	[Env.FACTION_ID_TIANREN]	= 85, --天忍掌门
	[Env.FACTION_ID_WUDANG]		= 87, --武当掌门
	[Env.FACTION_ID_KUNLUN]		 = 88, --昆仑掌门
	[Env.FACTION_ID_MINGJIAO]	 = 80, --明教掌门
	[Env.FACTION_ID_DALIDUANSHI] = 82, --大理段氏掌门
	[Env.FACTION_ID_GUMU]		= 294, -- 古墓
}
